{
  "data": [{
      "id": "401",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/401"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.305Z",
        "updatedAt": "2017-01-22T12:04:48.435Z",
        "slug": "kabuto-yakushi",
        "name": "Kabuto Yakushi",
        "malId": 2405,
        "description": "Sex: Male<br/>Birthday: February 29<br/>Bloodtype: AB<br/>Age: Part I: 19-20, Part II: 23-24<br/>Height: Part I: 176.2 cm, Part II: 177 cm<br/>Weight: 65 kg<br/>Relatives: Nonou Yakushi (Adopted Mother)<br/>Chakra Nature: Earth Release, Water Release<br/><br/>Kabuto Yakushi is Orochimaru's personal medic, assistant, and general right-hand man. Kabuto was found as a young boy by a chief medical officer of the Konoha Medical Unit Squad. The officer brought Kabuto with him back to Konoha and raised him as a son. Kabuto eventually began acting as a spy for numerous countries and organizations (such as Akatsuki) before coming under the servitude of Orochimaru. Kabuto has since used his various former affiliations as a means to gather intelligence on Orochimaru's behalf, such as entering the Chunin Exams as a Konoha ninja to gather information on his fellow participants for Orochimaru's use. Despite his apparent loyalty to Orochimaru, Kabuto's true personality is difficult to discern; he frequently switches from a lighthearted and polite teenager to a twisted and sadistic maniac that enjoys playing mind games with his opponents. While he generally obeys Orochimaru's orders, he is not above healing Orochimaru's enemies or trying to strike up polite conversations with Naruto Uzumaki when they meet. Orochimaru himself seems to have a hard time determining Kabuto's thoughts, and has suggested that Kabuto secretly works against him.<br/><br/>Kabuto is a talented ninja, being compared to Kakashi Hatake in ability on more than one occasion, as well as being shown capable of killing ANBU members with relative ease. The bulk of Kabuto's fighting ability lies in the medical jutsu taught to him by his adoptive father. These abilities have been further enhanced through his allegiance to Orochimaru, as he has been able to experiment on others to increase his medical knowledge. As a result, Kabuto is able to reactivate dead cells in a concentrated area and grow new ones. While he uses this ability in battle to immediately recover from attacks, it can also be used during his experiments to keep test subjects alive for much longer than is feasible. Kabuto can even temporarily reanimate a corpse for use as an ally or a decoy. During his battle with Tsunade, she remarks that his fighting and healing abilities surpass her own when she was his age. Despite his talents, Kabuto has always served others, a fate he is dissatisfied with. As such, after Orochimaru's defeat, Kabuto integrates his master's remains into his body as a means to become more powerful and to no longer be the mere tool of others. The remains have since begun trying to take over his body.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/401/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/401/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/401/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/401/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/401/castings"
          }
        }
      }
    },
    {
      "id": "402",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/402"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.338Z",
        "updatedAt": "2017-01-22T09:34:26.115Z",
        "slug": "ino-yamanaka",
        "name": "Ino Yamanaka",
        "malId": 2009,
        "description": "Personal Data:<br/>Birthday: September 23<br/>Horoscope: Libra<br/>Gender: Female<br/>Age: 12-13 (Part I), 16 (Part II)<br/>Height: 149.3 cm (4'89'')-151.2 cm (4'96'') (Part I), 162.2 cm (5'32'') (Part II)<br/>Weight: 38.2 kg-38.5 kg (Part I), 46 kg (Part II)<br/>Blood Type: B<br/>Clan: Yamanaka clan<br/>Family: Inoichi Yamanaka (Father)<br/>Affiliation: Konohagakure<br/>Team:<br/><span class=\"spoiler\">Team Asuma<br/>Konoha 11<br/>Team Three<br/>NijÃ…Â« ShÃ…ï¿½tai<br/>Fifth Division</span><br/>Rank: Genin (Part I), ChÃ…Â«nin (Part II)<br/>Registration ID: 012604<br/>Academy Grad. Age: 12<br/>ChÃ…Â«nin Prom. Age: 14<br/>Missions Completed: 40 (D-Rank: 23, C-Rank: 9, B-Rank: 6, A-Rank: 2, S-Rank:0)<br/>Favourite Phrase: \"The many words of flowers.\"<br/>Likes: Cherry tomatoes, custard pudding, Shopping<br/>Dislikes: Sashimi, Sakura at first<br/>Debut:<br/>Manga: Chapter #34<br/>Anime: Naruto Episode #1<br/>Jutsu:<br/><span class=\"spoiler\">Chakra Hair Trap Technique<br/>Demonic Illusion: Butterfly Evolution<br/>Formation Ino-Shika-ChÃ…ï¿½<br/>Four-Corner Sealing Barrier<br/>Mind Body Disturbance Technique<br/>Mind Body Switch Technique<br/>Mind Clone Switch Technique<br/>Mystical Palm Technique<br/>Ninja Art: Covered with Flowers<br/>Ninja Art: Moonlight Beauty</span><br/><br/>Ino Yamanaka is a childhood friend of Sakura Haruno who was bullied due to her large forehead, ending when Ino befriended her. She acted like a mentor, being tougher and more confident. Under her influence, Sakura began to develope her own identity. Though close to Ino, Sakura could not help but feel she was in her shadow and upon learning they liked the same boy, ended their friendship so that they could compete for his affection, beginning a bitter rivalry. Ino shed her tomboyish look in retaliation and was more open about her feelings towards Sasuke. The rivalry stays till the Chunin Exam. Nevertheless, they have a competitive relationship. She became somewhat superficial, thinking highly of her looks and has no problem telling people what she thinks, no matter how hurtful, such as telling Choji that he should focus more on his appearance because girls dislike overweight boys. On the surface of things, both of her teammates fit the profiles of people she wouldn't associate with because of her apparent shallowness, but she actually cares deeply for their well-beings and maintains a strong bond with them. It should be noted that while Ino is portrayed as shallow she came to Sakura's aid in the Forest of Death despite their feud. She cares very much about her friends, showing deep loyalty.<br/><br/>As a member of the Yamanaka clan, Ino works in her family's flower shop and has become particularly talented in ikebana. She has been noted to be sharp upon occasion, such as noticing Asuma's affection for Kurenai or using chakra cleverly. The anime's filler arcs show that she's been able to find other uses for her time in the shop and can tell a person's profession by simply glancing at the condition of their hands. Being a Yamanaka has also shaped the mind-altering jutsu she uses. With the Mind Body Switch Technique, Ino can transfer to another's body and use it for a time. The anime explains her medical abilities. During the final filler arc, Ino finds herself of no use to her teammates and becomes awed of Sakura's skills. As such, Ino becomes Tsunade's second apprentice, hoping to be more useful to her friends. The anime has also shown that Ino has developed her own inner-self named \"Inner Ino\". She, along with team 10 plus Kakashi, aids in the dispersion of two of Akatsuki's members.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/402/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/402/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/402/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/402/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/402/castings"
          }
        }
      }
    },
    {
      "id": "403",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/403"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.381Z",
        "updatedAt": "2017-01-22T10:46:48.681Z",
        "slug": "inoichi-yamanaka",
        "name": "Inoichi Yamanaka",
        "malId": 15072,
        "description": "Inoichi Yamanaka is a Jonin from Konohagakure, and alongside Shikaku Nara and Choza Akimichi, he is a part of the first Ino-Shika-Cho trio. <br/><br/>He is a member of the Yamanaka clan and owns the Yamanaka flower shop along with his daughter Ino Yamanaka. Inoichi is a member of the Ino-Shika-Cho trio, which consists of three Jonin from the Yamanaka clan, the Nara clan, and the Akimichi Clan, respectively. His daughter, Ino, is a member of her own Ino-Shika-Cho, judging that their fathers were once team-mates themselves in their early days as ninja. <br/><br/>Inoichi, presumably the head of the Yamanaka clan, has shown himself to be a highly capable ninja. He is well-versed in all of his clan's secret techniques. During the Invasion of Konoha in Part I, Inoichi skilfully performs the Mind Body Disturbance Technique to make the invaders he encounters fight against their own allies without any self-control. Further proof of his skill was shown from his status as an interrogator during Pain's invasion. He was able to skilfully probe the mind of one Pain's Amegakure loyalist's, able to perceive a person's entire day of memories in under a minute, even though Pain had guarded it with mental blocks and traps. He has also shown the ability to communicate telepathically with his daughter, Ino.<br/><br/>He is also skilled at tracking targets through their chakra trail, as long as the target's chakra signature stays the same. <br/><br/>Techniques: <br/> * Chakra Sensing Technique (Manga only)<br/> * Formation Ino-Shika-ChÃ…ï¿½<br/> * Mind Body Disturbance Technique<br/> * Mind Reading<br/> * Yamanaka Clan Telepathy",
        "image": {
          "original": "https://media.kitsu.io/characters/images/403/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/403/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/403/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/403/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/403/castings"
          }
        }
      }
    },
    {
      "id": "404",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/404"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.394Z",
        "updatedAt": "2017-01-22T11:13:04.132Z",
        "slug": "aoba-yamashiro",
        "name": "Aoba Yamashiro",
        "malId": 17553,
        "description": "Aoba served as a JÃ…ï¿½nin ninja in Hidden Leaf Village.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/404/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/404/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/404/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/404/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/404/castings"
          }
        }
      }
    },
    {
      "id": "405",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/405"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.406Z",
        "updatedAt": "2017-01-22T11:40:01.752Z",
        "slug": "kurenai-yuuhi",
        "name": "Kurenai Yuuhi",
        "malId": 4773,
        "description": "Birth Date: June 11th<br/>Age: 27-28 (Part I), 31 (Part II)<br/>Weight: 54.4 kg<br/>Height: 169.1 cm<br/>Ninja Registry No: 010881<br/>Ninja Rank: Jounin<br/><br/>Kurenai Yuuhi is the Konoha Jounin in charge of Team 8, which consists of Kiba Inuzuka, Shino Aburame, and Hinata Hyuuga. Kurenai's team specializes in tracking, and she herself is a highly talented genjutsu specialist.<br/><br/>While she has a close bond with all of her students, she is especially concerned for Hinata. Kurenai knows how Hinata is viewed by her father, even though she is technically the heiress of the clan since she is the eldest child. She is also aware of her student's infatuation for Naruto Uzumaki. When Hinata tried to offer Naruto some medicine after his fight with Kiba, Naruto was hesitant to take it. Kurenai convinced him to take it. Her personality is unyielding, honest, and simple. She also says she is a \"big sister type\".<br/><br/><span class=\"spoiler\"> Three years later, she is pregnant with Asuma's child.</span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/405/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/405/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/405/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/405/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/405/castings"
          }
        }
      }
    },
    {
      "id": "406",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/406"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:31.953Z",
        "updatedAt": "2017-01-22T10:15:56.481Z",
        "slug": "franky",
        "name": "Franky",
        "malId": 64,
        "description": "Name: Franky<br/>Age: 34; 36<br/>Birthdate: March 9<br/>Zodiac Sign: Pisces<br/>Height: 225 cm (7'4Â½\")<br/>Affiliation: Straw Hat Pirates (previously; Franky Family, Tom's Workers)<br/>Position: Shipwright<br/>Devil Fruit: none<br/>Bounty: <span class=\"spoiler\">94,000,000 (previously: 44,000,000) </span><br/><br/>Franky is a 34 year old cyborg who is the shipwright of the Straw Hat Pirates and their second most recently recruited member. He first appeared in the Water 7 arc. Franky is one of \"Tom's Workers\", with original name \"Cutty Flam.\"<br/><br/>Franky's dream is to build a ship that would travel to the end of the Grand Line. This is the ship that the Straw Hats are currently riding, but his dream is not yet achieved until they make it to the end.<br/><br/>Franky usually acts tough and is quickly angered, but he is also very emotional when it comes to sad tales and often bursts into large tears, or on some occasions, plays a song. His most distinguishable personality trait is his flamboyant attitude. He frequently shouts the word 'SUPER' when he's in a positive mood, or adds it into his speech. He also has a signature pose which he uses very often.<br/><br/>Franky is quick to defend other people (e.g. Franky Family, Nico Robin) and take action if his friends are harmed. He is also quick in making friends, allies, and comrades with even the most unlikely of individuals. Because of this, he is seen as a 'big brother' figure. Monkey D. Luffy bears similar qualities (with the exception of engaging in unnecessary fights) and because of this, despite the disputes the two had in the past, both grew to respect each other during the events of the Enies Lobby Arc.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/406/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/406/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/406/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/406/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/406/castings"
          }
        }
      }
    },
    {
      "id": "407",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/407"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.007Z",
        "updatedAt": "2017-01-22T11:40:42.621Z",
        "slug": "sanji",
        "name": "Sanji",
        "malId": 305,
        "description": "Name: Sanji<br/>Age: 19; 21<br/>Birthdate: March 2 ; Pisces<br/>Height: 177 cm (5' 9\")<br/>Blood Type: RH-<br/>Affiliation: Straw Hat Pirates (previously; Baratie)<br/>Position: Cook<br/>Devil Fruit: none<br/>Bounty:<span class=\"spoiler\">177,000,000 (previously: 77,000,000) </span><br/><br/>Sanji is the chain-smoking chef of the Straw Hat Pirate Crew. He has superb fighting skills that only make use of his legs, in an effort to minimize damage to his hands which would impair his cooking skills.<span class=\"spoiler\">Except a single fight where he uses knives against a fellow chef.</span> Sanji uses an array of powerful and varied kicking moves when he fights. His cooking skills are world class, and he was mentored in both cooking and fighting by Chef \"Red Leg\" Zeff of the Baratie. He was born in the North Blue, but grew up in the East Blue.<br/><br/>Sanji is trash-talking and serious, and usually gruff and impatient, especially around men. This is contrasted by his \"love-cook\" side, as he is very amorous around women. Sanji is completely devoted to any beautiful woman, usually losing all common sense and composure in front of them, then attempting to comically swoon them. This behavior has earned him the nickname \"ero-cook\", or perverted cook. He can also be very chivalrous and gentlemanly around woman, volunteering to help them in various tasks and situations, whether they need help or not. He has sworn to never let insult or injury happen to any woman while he can still stand, even if that woman is trying to kill him. This is often problematic in his fighting as he can't attack female opponents, and would rather die than hurt them. All this is apparently the result of a \"strict upbringing\". To contradict his gentlemanly behavior, Sanji also enjoys seeing women wear skimpy clothing, and can be a voyeur.<br/><br/>His goal in life is to find the All Blue, a legendary ocean, which contains all the fish in the world. As such, it would be paradise for any cook with as much love for his work as Sanji, who holds great respect for the tools, ingredients, and art of cooking. So great is his devotion to his calling, that Sanji will not let any person or creature starve, regardless of them being friend or foe.<br/><br/>Being the crew's chef, he looks out for the health of his crew mates. Sanji respects Luffy as a captain, but often gets angry at him for eating too much, showing disrespect for the aesthetics of cooking, and generally being daft and irresponsible. He is constantly in petty fights with Zoro (sometimes calling him Marimo) over each others' traits and they have developed a rivalry, but have managed to make a devastating team together. He is very protective of the female crew members and Nami likes to take advantage of him, exploiting his extreme servility. Sanji originally wanted to cook Chopper, but has come to respect him as a crew member and friend. He's also good friends with Usopp; they team up and interact often, and Sanji understands him quite well. In short, he cares as much for the crew as any Straw Hat should, but unlike Zoro, Sanji shows these feelings more.<br/><br/><span class=\"spoiler\">It is revealed that Sanji is the third son of the Vinsmokes, a family of killers. His father and one of the Yonkou, Big Mom, has arranged a marriage between him and the 35th daughter of the Charlotte family, Pudding.</span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/407/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/407/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/407/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/407/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/407/castings"
          }
        }
      }
    },
    {
      "id": "408",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/408"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.112Z",
        "updatedAt": "2017-01-22T09:58:33.765Z",
        "slug": "nami",
        "name": "Nami",
        "malId": 723,
        "description": "Age: 18; 20<br/>Birthdate: July 3, Cancer <br/>Height: 169 cm (5' 6Â½â€)<br/>Sizes: 95 - 55 - 85<br/>Affiliation: Straw Hat Pirates (previously; Arlong Pirates)<br/>Position: Navigator<br/>Devil Fruit: none<br/>Bounty: <span class=\"spoiler\">66,000,000 (previously: 16,000,000) </span><br/><br/>She is the first member of the Straw Hat Pirates to appear (in the anime), but the third to align herself with the crew, and the fifth to actually join. Possibly one of the best (or even the best) navigators currently sailing the Grand Line, she has the ability to recognize and analyze even the slightest changes in the weather through sheer intuition, thus saving the ship and the crew from the very unstable Grand Line weather on multiple occasions.<br/><br/>Nami has a tattoo on her left shoulder (a homage to her past), where she used to have a shark tattoo for being a member of Arlong's Crew. The new tattoo represents mikan (a fruit commonly know as tangerine) and pinwheels <br/><br/>She respects Luffy's qualities as a leader, but often gets angry of his irrational thinking and short attention span, even so she trusts him with her life. Despite the fact that Nami has deceived the crew, Luffy still trusts her enough to allow her to safe-keep his precious straw hat. She is almost always the one who gives orders on the ship (much to the Zoro's resentment) because of Luffy's usual lack of common sense. She often comically beats or hits her other crewmates for their nonsense, which occurs quite often. Robin is actually the only person Nami doesn't try to boss, and she refered to her as the only person who understands her, though in a comical fashion. She is very manipulative as well and can even turn an entire conversation in her favor when necessary, often putting on disguses and tricking the enemy. Acting as the \"mother\" of the crew, Nami doesn't understand or approve of the boys' often macho attitudes and principles. These are the only situations where Nami doesn't get the final word. <br/><br/>Nami's two favorite things are money and tangerines. She is greedy and will do anything, aside from abandoning or killing her friends, for money. Due to her past - After having gathered money for 8 years (and even before that often stole things), Nami is naturally accustomed to it, but thinks of her friends as more important. She is very manipulative, and often takes advantage of Sanji for his devotion to her and Usopp to maintain her weapons. Roronoa Zoro tries not to fall for her schemes, but ends up a victim like the rest, usually due to debt and blackmail. Nami also tries to avoid fights, and is one of the less adventurous and brave members of the crew. However, since the invention of her Clima Tact (A weapon that forms weather patterns), she is now seen fighting her own battles instead of becoming the 'easy target', as she doesn't want to be the one being saved anymore.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/408/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/408/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/408/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/408/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/408/castings"
          }
        }
      }
    },
    {
      "id": "409",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/409"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.197Z",
        "updatedAt": "2017-01-22T08:42:09.216Z",
        "slug": "usopp",
        "name": "Usopp",
        "malId": 724,
        "description": "Name: Usopp<br/>Age: 17, 19<br/>Birthdate: April 1, Aries <br/>Height: 174 cm (5'8Â½\")<br/>Affiliation: Straw Hat Pirates (previously; Usopp Pirates)<br/>Position: Sniper<br/>Devil Fruit: none<br/>Bounty: <span class=\"spoiler\">200,000,000 (previously: 30,000,000)</span><br/>Likes: Being seen as a hero, the Going Merry, Adventure <br/>Dislikes: Failure<br/><br/>Usopp is a liar and likes to play pranks on his crew members or just goof off with Luffy and Chopper. He loves to tell tall tales to Chopper (who believes him blindly) or anyone who's listening. The other aspect of Usopp besides his lying is his cowardice; he is a very timid person, or so he thinks. In extremely stressful situations, Usopp has proven to be far more courageous than he believes himself to be. He shows great resolve when his friends are threatened or mocked by outsiders. Even though he is a complete coward in battle (except as his alter ego, Sogeking), he is a useful part to the Straw Hat Pirates. He is extremely handy and can fix almost anything. He sometimes sees a role model in Zoro who never seems afraid but always proud. Usopp lacks a bit of self esteem and is often taken advantage of by Nami to make her weapons or repair and improve them - something he is very adept at, having constructed the ingenious weapon \"Clima Tact.\"<br/><br/>Usopp will also stand up and fight for not only the well-being of people, but also for their ideals - and the ideals of a pirate, which he holds very high. In battle he normally tries to trick his enemy by telling tales or mischievous lies to deceive them. Despite his lack of physical strength compared to other members of the crew, Usopp seems to be just as resilient as his comrades and this ability to bear loads and loads of damage, is one of his best traits, in addition to his cunning and intelligence, which has saved the Straw Hats on many occasions. Also, Usopp has outstanding marksmanship abilities with his slingshot and is on his way to becoming one of the best snipers in the One Piece world, although his goal in life is to become a proud and strong pirate like his father Yasopp of the Red Haired Pirate Crew.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/409/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/409/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/409/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/409/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/409/castings"
          }
        }
      }
    },
    {
      "id": "410",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/410"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.268Z",
        "updatedAt": "2017-01-22T12:20:23.716Z",
        "slug": "brook",
        "name": "Brook",
        "malId": 5627,
        "description": "Age: 88; 90<br/>Birthdate: April 3; Aries<br/>Height: 2m 66cm (8'8Â½\")<br/>Affiliation: Straw Hat Pirates (previously; Rumbar Pirates)<br/>Position: Musician, Swordsman<br/>Devil Fruit: Yomi Yomi no Mi (Revive Revive Fruit)<br/>Type: Paramecia<br/>Bounty: <span class=\"spoiler\">83,000,000 (previously: 33,000,000) </span><br/><br/>Brook known as the \"Gentleman Skeleton\", is a pirate inhabiting the Florian Triangle region of the Grand Line. Although he claims to be a gentleman, and talks in the dialect of one, Brook's etiquette has severely degenerated over the course of his isolation. He has awful table manners: he shouts for food while waiting to be served, asks to swap plates with people who have larger servings than he does and eating so messily his entire face is stained. He is also extremely flatulent after meals, but says \"excuse me\" so as to be \"gentlemanly.\" He also loves to tell odd, bone-themed jokes, as well as melodramatic tales, and is very perverted, asking to see Nami and Robin's underwear upon meeting them. <br/><br/>He's a skilled musician (something Luffy has always wanted in his crew since the beginning), fond of playing the violin. Due to his light weight he can not only jump to incredible heights but can run on water by moving his legs furiously. He uses a shikomizue as his main weapon; with it, he is able to make swift iaidÃ…ï¿½ attacks that the enemy cannot notice.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/410/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/410/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/410/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/410/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/410/castings"
          }
        }
      }
    },
    {
      "id": "411",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/411"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.281Z",
        "updatedAt": "2017-01-22T11:49:35.057Z",
        "slug": "luffy-monkey-d",
        "name": "Luffy Monkey D.",
        "malId": 40,
        "description": "Name: Monkey D. Luffy<br/>Age: 17; 19<br/>Birthdate: May 5, Taurus<br/>Height: 172 cm; 174 cm<br/>Blood Type: F<br/>Affiliation: Straw Hat Pirates<br/>Position: Captain<br/>Devil Fruit: Gomu Gomu no Mi (Gum Gum Fruit)<br/>Type: Paramecia<br/>Bounty:<span class=\"spoiler\">500,000,000 (previously; 30,000,000, 100,000,000, 300,000,000, and 400,000,000)</span><br/><br/>Luffy is the captain of the Straw Hat Pirates and is best friends with all of them and values them over all else. At first glance, Luffy does not appear to be very intelligent, often seeing things in childish manner and can easily be amazed by the simplest things. However, because he views the world in a straightforward and simple manner, he is occasionally the only person who can see past the events and see what should be done. <br/><br/>Luffy seems to have an unstoppable appetite, a characteristic that is common to the Japanese archetype of the (at times simple-minded) young male hero/adventurer with a heart of gold; perhaps the hunger more so in Luffy's case due to having an elastic stomach. Luffy is also another one of the several characters given the middle initial \"D.\"<br/><br/>Although Luffy is fairly lightheaded and a funny character, he has an unstoppable sense of determination, optimism and commitment and will do anything to stand up for his friends and comrades. Along with that, he has great courage to back it up as well as unbelievable strength. Ever since consuming the devil fruit he was shown to be not worried about his inability to swim, much like his brother. Much of these traits are common among D's. His only display of true fear is towards his grandfather, to the point that he is intimidated at the mere mention of him.<br/><br/>Luffy never kills any of his enemies, no matter how cold-hearted they are; instead, he frequently sends the villain flying, knocking them out or beating them to a point that they are almost near death, which results in some of the villains searching for revenge, such as Buggy the Clown and Alvida. Oda explains that it's not a question of morality so much as a matter of punishing the villains for their crimes - he feels that killing the villains lets them off too lightly, whereas he considers letting them live to see their dreams be ruined a far more fitting punishment.<br/><br/>Luffy's dream is to find the One Piece and become Pirate King. He knows that to achieve his goal, he will have to defeat many strong opponents, including the World Government and his childhood hero Shanks.<br/><br/><span class=\"spoiler\">Monkey D. Luffy is the son of Monkey D. Dragon, the leader of the Revolutionary Army and the world's most wanted criminal. His grandfather is \"The Hero of The Marines\", Vice Admiral Monkey D. Garp. <br/><br/>Before the start of the series, Dragon left Luffy in Garp's care. Dragon first appears after a lightning bolt suddenly destroys the gallows where Luffy was to be executed by Buggy the Clown and then saves Luffy from being captured by Captain Smoker. When he saved Luffy from Smoker, a mighty gust of eerie wind swept through Loguetown. It is undetermined whether or not he was the cause behind the gust of wind or the lightning; however, the story leads to believe there is more to him than it seems. Recently, he has taken over an island in the South Blue and is about to head to the North Blue when he commented, after noticing Luffy's newest bounty, given to him after invading Enies Lobby, that father and son will meet sometime soon.</span><br/>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/411/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/411/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/411/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/411/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/411/castings"
          }
        }
      }
    },
    {
      "id": "412",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/412"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.352Z",
        "updatedAt": "2017-01-22T09:55:00.582Z",
        "slug": "robin-nico",
        "name": "Robin Nico",
        "malId": 61,
        "description": "Age: 28; 30<br/>Birthdate: February 6, Aquarius<br/>Height: 188cm (6'2\") <br/>Sizes: 99 - 59 - 89<br/>Affiliation: Straw Hat Pirates (previously; Baroque Works)<br/>Position: Archaeologist<br/>Devil Fruit: Hana Hana no Mi (Flower Flower Fruit)<br/>Type: Paramecia<br/>Bounty: <span class=\"spoiler\"> 130,000,000 (previously: 79,000,000; 80,000,000)</span><br/>Robin is the seventh member of Straw Hat's Crew. She had a bounty of 79 million beri (One Piece currency) since she was eight years old, during an incident in which she supposedly destroyed six Buster Call ships through the use of the powers she gained by the eating the Hana Hana no Mi (Flower Flower or Blooming Blooming Fruit). The fruit's power enables her to conjure up multiple replicas of her body parts (most often her arms) upon any surface she is able to see making her very powerful and dexterous as a result. <br/><br/>Robin joined the Straw Hat Pirates after Luffy saved her life, or (how she states it) Luffy forced her to live when she wanted to die. To atone for his crime, Robin demands that Luffy allow her to join his crew, to which he complies leaving every other crew member except Sanji in shock. Although feared at first, she is quickly accepted and viewed as a comrade by the crew.<br/><br/>Robin is actually an archaeologist of talent, and despises anyone who thoughtlessly damages any piece of history. The World Government fears her because she can decipher Poneglyphs (stones marked with glyphs from an ancient language), which contain details capable of reviving ancient weapons that have the power to destroy the world. In reality, Robin has stated that she does not care about ancient weapons, and that her dream is to find the True History written on the Rio Poneglyph.<br/><br/>Robin is a mysterious and serious person who appears quiet and reclusive, and the wisest in the Straw Hat's Crew. She was thought by those around her to be cold and mean, but it was proven that she is actually a kind person who always thinks before she acts. She often only speaks when something interesting or important has happened. She loves to study history, and the comfort and freedom to study and read. She is also quick to point out gross or realistically morbid facts, often creeping out Nami or Usopp. Robin is the wisest and most sensible member of the crew. She has a vast knowledge of the seas and the world, and usually keeps her head during surprising situations, allowing her to logically analyze the situation without losing her cool. This trait makes her different from the other Straw Hats, who often comically react melodramatically to unexpected happenings and hold irrational ideas and conclusions. Despite her attempts to keep herself distant, Robin has fallen for her new friends, and has taken the role of the distant den mother.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/412/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/412/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/412/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/412/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/412/castings"
          }
        }
      }
    },
    {
      "id": "413",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/413"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.420Z",
        "updatedAt": "2017-01-22T11:43:50.432Z",
        "slug": "zoro-roronoa",
        "name": "Zoro Roronoa",
        "malId": 62,
        "description": "Name: Roronoa Zoro<br/>Age: 19; 21<br/>Birthdate: November 11, Scorpio <br/>Height: 178 cm (5'10\") , 181 (5'11\") (after timeskip)<br/>Affiliation: Straw Hat Pirates<br/>Position: Swordsman<br/>Devil Fruit: None<br/>Bounty: <span class=\"spoiler\">320,000,000 (previously: 60,000,000 and 120,000,000)</span><br/><br/>Zoro was the first crew member to be recruited by Luffy. Zoro is a skilled swordsman who fights with his own unique sword style known as santoryu (three katana fighting style).This is achieved by using one katana in each hand and another in his mouth. He is also seen fighting with only one or two swords. When in a serious fight he ties his bandana, normally tied on the arm, on his head. <br/><br/>Though not a samurai, he appears to maintain a certain degree of bushido, and is frequently mistaken for one. Unlike Luffy and most of the other Straw Hat pirates, Zoro has been known to kill his opponents if he has to, though never in cold blood.<br/><br/>Zoro has a stern, serious and distanced personality, but, unlike Robin, he often reacts in a goofy and exaggerated comic style due to his gruff, impatient attitude. On the ship, he normally either trains with weights or sleeps. The only work he is seen doing regularly is hoisting the anchor using his great strength. He also likes sake, almost to the degree that Luffy likes meat, but like Nami, he never gets drunk due to his inhumanly-high endurance and tolerance for alcohol. Another notable trait is his lack of orientation, as Zoro often gets lost, even in small, familiar spaces or when being led by someone. Despite this, he is often the first to sense an enemy or danger, and the first to react. He is often displayed being well aware of dangerous situations and people around him.<br/><br/>Zoro often also reminds others of the harsh facts, which often shocks some of the other crew members, although they usually decide he is right. Zoro has also stated that he is an atheist, and has never believed in anything except himself. He often comes across as arrogant and overconfident, but only because he knows he's a strong man with great fighting ability. Even so, Zoro knows that he still has a lot of untapped potential, and is constantly seen training and trying to improve his fighting skills. He also adheres to a strict sword master's code of honor, and never falsely brags or lies about his abilities, sometimes outright admitting a weakness, even to an enemy. He also never tries to escape from a fight or use trickery to win, believing that doing so is cowardly and scorning anyone who uses such tactics. Zoro is very vigorous, strong-willed, and determined.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/413/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/413/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/413/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/413/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/413/castings"
          }
        }
      }
    },
    {
      "id": "414",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/414"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.506Z",
        "updatedAt": "2017-01-22T12:24:54.345Z",
        "slug": "chopper-tony-tony",
        "name": "Chopper Tony Tony",
        "malId": 309,
        "description": "Age: 15, 17<br/>Birthday: December 24<br/>Zodiac sign: Capricorn<br/>Affliation: Straw Hat Pirates<br/>Position: Doctor<br/>Devil Fruit: Hito Hito no Mi (Human Human Fruit)<br/>Type: Zoan<br/>Bounty:<span class=\"spoiler\">100 (previously: 50) </span><br/>He is the Straw Hat crew's general physician despite being a reindeer. After a set of unusual circumstances, he ate the Hito Hito no Mi (Human Human Fruit), which permitted him the ability to speak, think, and, to a limited extent, change into a human.<br/><br/>Chopper often acts like a child, but he is an upright friend and companion who will try anything to overcome a task given by his team. He also still has distrust in humankind because of events his youth, where he was treated as a brutal monster. He will often outright insult a human who compliments him while smiling, dancing, and being obviously pleased. He also shows a certain interest in books, but mostly medicine related ones.<br/><br/>Chopper is more or less on a journey to define himself, seeing almost anybody on his crew as a role model. This, combined with his naiveness, often causes him to imitate the other Straw Hats' actions, no matter how obviously silly. Because of this, he often gets involved in the crazy antics of Luffy and Usopp, wholeheartedly believing that what they are doing is sensible and fun. Chopper is one of the most innocent Straw Hat Pirates, and is also very naive, resulting in a tendency to believe anything told to him, even the outrageously fictitious and exaggerated lies of Usopp. Sanji originally wanted to cook Chopper and continues to refer to him as \"the emergency food supply\" to tease him but considers him a friend. Although he is the crew's doctor he wasn't originally hired by Luffy for that purpose. But actually, in Luffy's words, for being \"cool reindeer that can transform.\"",
        "image": {
          "original": "https://media.kitsu.io/characters/images/414/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/414/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/414/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/414/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/414/castings"
          }
        }
      }
    },
    {
      "id": "415",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/415"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.577Z",
        "updatedAt": "2017-01-22T08:51:36.496Z",
        "slug": "buggy",
        "name": "Buggy",
        "malId": 725,
        "description": "Buggy accidentally consumed the Bara Bara no Mi, (Chop Chop fruit) a Devil Fruit, which allows him to separate his body parts and control them independent of each other, but robbed him of the ability to swim. The abilities gained from this fruit also make Buggy immune to attacks from knives or swords; any such attack just separates him into his component parts.<br/><br/>In addition, most of his body is capable of flying through the air, fast enough to propel a man through a wall - with the crucial exception of his feet. However, even though the parts are separate, Buggy can still feel what the part feels (for example, when Luffy attacked Buggy, he separated his torso from his waist, only to find that Luffy was aiming for the crotch. Needless to say this left him with a rather painful result. Also when Buggy launched his hand out to pin down Zoro for Cabaji's Sting of the Unicycle Technique, Luffy stomped on it, inflicting tremendous pain). He also seems to require either a fixed distance from his detachments, or keep them within his line of vision, in order to manipulate them separately.<br/><br/>Besides his Devil fruit abilities he usually fights with three knives between his fingers. During the flashbacks of his youth he already used these three knives. He also has a blade hidden in his shoe and in Logue Town used a sword in his failed attempt to execute Luffy.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/415/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/415/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/415/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/415/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/415/castings"
          }
        }
      }
    },
    {
      "id": "416",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/416"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.627Z",
        "updatedAt": "2017-01-22T08:25:56.627Z",
        "slug": "shanks",
        "name": "Shanks",
        "malId": 727,
        "description": "Age: 37; 39<br/>Birthday: March 9<br/>Affiliations: Red Hair Pirates; Yonko; <span class=\"spoiler\">Roger Pirates (former)</span><br/>Red-Haired Shanks is a legendary and powerful pirate in the Grand Line, being the captain of the Red Haired Pirate Crew and one of the Four Emperors in the second half of the grand line. Furthermore, he is Monkey D. Luffy's childhood hero and a former member of Gol D. Roger's Crew. Overall, he is greatly respected by most of the characters, despite having a \"soft\" and friendly nature and never appearing in actual combat until he started a fight with Whitebeard. As a whole, he does not make many appearances in the series, although he appears in a majority of the opening or closing themes of the anime.<br/><br/>Shanks always wears a long black cape over his shoulders and until he met Luffy, wore a straw hat that he had worn for many years beforehand. He always wears trousers that are cut below the knee as well as a pair of sandals. The most striking thing about Shanks is the color of his red hair, of which his nick-name \"Red Haired Shanks\" comes from. He also has three scars across his left eye, which were given to him by Blackbeard a long time ago. He has a missing left arm, that he had lost when he saved Luffy from a Sea King. Shanks and his crew are almost always seen partying and drinking alcoholic beverages whenever they make an appearance as the Captain's favorite pastimes are attending and hosting parties and banquets.<br/><br/>According to Oda, Shanks is the one character that resembles himself the most out of all the One Piece characters, because of his fun-loving partying nature.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/416/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/416/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/416/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/416/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/416/castings"
          }
        }
      }
    },
    {
      "id": "417",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/417"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.672Z",
        "updatedAt": "2017-01-22T12:03:08.259Z",
        "slug": "enel",
        "name": "Enel",
        "malId": 1541,
        "description": "Name: Enel<br/>Birthdate: May 6, Taurus<br/>Blood Type: A<br/>Affiliation: Enel's Warriors<br/>Position: God of Skypiea<br/>Devil Fruit: Goro Goro no Mi (Rumble Rumble Fruit)<br/>Type: Logia<br/><br/>Enel thinks of himself as an invincible god - quite literally. He believes that he is a divine and immortal being, with the authority to do, take or destroy whatever he pleases. As the result, he appears fearless, childish, and without a care in the world. His lifestyle is relaxed and hedonistic, and when not attending to his godly duties of smiting the natives of Skypeia, he spends his time sleeping or eating (Enel's favourite fruit is apples) in his residence, being waited on hand and foot by beautiful women. This attitude carries over to his battles, where he's hardly serious and barely annoyed - instead he's relaxed, and enjoys himself by effortlessly absorbing attacks, and humiliating his opponents. In his fight against Kamakiri, he even went to sleep in the middle of the fight, in order to prove his immortality.<br/><br/>Enel holds no regard for other's lives except his own, and has no moral qualms about killing thousands- instead he sees it as his godly duty, and laughs as he sends Skypeia to its doom. He is in short completely insane, which was more or less undeniable when he sets off for the moon, which he believes to be the home of God (himself). Before Luffy showed up, his fruit power and mantra ability made his God complex completely legitimate. Once Luffy began gaining the upper hand in the battle he incapacitated him, in order to remove him as a threat, and reclaim his status as \"invincible\" - and from this point acts somewhat cowardly, trying his best to avoid another confrontation with Luffy.<br/><br/>Enel appears to posses a vast knowledge of mechanics and technology, as well. He personally designed his flying ark, Maxim, and knows its inner workings inside and out; if any damage is done to the inside, he is able to repair it (assuming it's repairable). He was even able to design a stormcloud production system (known as Deathpiea), an electrical power system, and a Jet Dial failsafe for the ark, in the event that the main engines are damaged.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/417/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/417/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/417/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/417/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/417/castings"
          }
        }
      }
    },
    {
      "id": "418",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/418"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.695Z",
        "updatedAt": "2017-01-22T11:58:14.126Z",
        "slug": "kuro-3f607d72-c511-480b-a59c-8f2951d7d5ff",
        "name": "Kuro",
        "malId": 2519,
        "description": "Kuro is the former Captain of the Black Cat Pirates. He is known as \"Kuro of the Thousand Plans\" for his elaborate plans that virtually never fail. Thusly, he earns the title of the second most intelligent person in the East Blue behind Ben Beckman. He has super-human speed with which to deliver his attacks. His skill is such that at full speed he is only able to be seen as a vague blur or by the damage his attacks cause. He primarily uses a special attack called Shakushi (Death Scoop/Death Ladle), that allows him to sweep a large area, killing anything his claws connect with at random, including his own crew. The technique travels roughly the same speed as CP9's Soru ability. The difference is that when Kuro uses that technique, he cannot see what he is attacking, whereas CP9 have mastered this ability and therefore can.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/418/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/418/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/418/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/418/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/418/castings"
          }
        }
      }
    },
    {
      "id": "419",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/419"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.751Z",
        "updatedAt": "2017-01-22T11:42:46.516Z",
        "slug": "bellamy",
        "name": "Bellamy",
        "malId": 2748,
        "description": "Bellamy \"The Hyena\" is the captain of the crew and has a 55,000,000 Beli bounty. Bellamy earned his nickname from his trademark grin and his reputation for scavenging riches from other pirates, much like a hyena scavenges its food. Bellamy's character is one that is arrogant, violent and vain, but significantly humbled when facing more powerful foes, as he revealed to Donquixote Doflamingo that he only engages in fights that he knows he can win. This later led to his defeat by Monkey D. Luffy, whom Bellamy thought was weak. Bellamy and his pirate crew play a significant role in the Jaya Arc of the series.<br/><br/><span class=\"spoiler\">After the end of the Skypiea arc, the true leader of the Bellamy Pirates, Donquixote Doflamingo travels to Jaya to kick Bellamy out of his crew and forces Sarquiss to attack and apparently kill him \"as a lesson,\" for disgracing his flag.</span><br/><br/><span class=\"spoiler\">Appears in the newest One Piece arc (manga) chapter 706 confronting Luffy and telling him he won't laugh at him anymore.<br/></span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/419/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/419/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/419/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/419/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/419/castings"
          }
        }
      }
    },
    {
      "id": "420",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/420"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.774Z",
        "updatedAt": "2017-01-22T10:18:42.307Z",
        "slug": "crocodile",
        "name": "Crocodile",
        "malId": 2749,
        "description": "Age: 44; 46<br/>Birthday: September 5<br/>Affiliations: Baroque Works; Shichibukai <span class=\"spoiler\">Both former</span><br/><br/>Crocodile is the leader of Baroque Works, a secret organization of assassins and spies, and a member of the Shichibukai. Utilizing Baroque Works, he incites rebellion in the kingdom of Alabasta in order to gain access to the Poneglyph hidden beneath the palace. He believes it will reveal the location of the weapon Pluton, which Crocodile wishes to gain control of in order to establish his military power. He is defeated by Monkey D. Luffy and stripped of his Shichibukai status by the World Government, after which he is imprisoned. Crocodile ate the fictional Devil Fruit Suna Suna no Mi (Sand Sand Fruit, Ã£â€šÂ¹Ã£Æ’Å Ã£â€šÂ¹Ã£Æ’Å Ã£ï¿½Â®Ã¥Â®Å¸), giving him the ability to control sand, as well as avoid damage by turning into sand. According to series creator Eiichiro Oda, Crocodile's bounty would have been more than twice it's value if he wasn't a Shichibukai (his former bounty before accepting Shichibukai status was 81,000,000).",
        "image": {
          "original": "https://media.kitsu.io/characters/images/420/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/420/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/420/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/420/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/420/castings"
          }
        }
      }
    },
    {
      "id": "421",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/421"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.806Z",
        "updatedAt": "2017-01-22T11:45:07.243Z",
        "slug": "tashigi",
        "name": "Tashigi",
        "malId": 2750,
        "description": "Sergeant Tashigi is a Naval officer serving under Commodore Smoker. She is first introduced, at the rank of Master CPO, when the Straw Hat Pirates dock in Loguetown. While adept at sword fighting, she is unusually clumsy, almost stabbing herself accidentally with her own sword on one occasion. She is also very well-versed in the famous katana of One Piece, knowing their names and origins. Tashigi wields Shigure, a Wazamono sword.<br/><br/>Tashigi's stated goal is to remove all MeitÃ…ï¿½ ,named swords with prestigious histories, from the hands of those who would use them for their own ends. After meeting Roronoa Zoro she set out to sea with Smoker, chasing after him and the rest of the Straw Hat crew. She bears a striking resemblance to Kuina, Zoro's deceased childhood friend.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/421/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/421/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/421/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/421/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/421/castings"
          }
        }
      }
    },
    {
      "id": "422",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/422"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.870Z",
        "updatedAt": "2017-01-22T10:30:09.272Z",
        "slug": "kuzan",
        "name": "Kuzan",
        "malId": 2752,
        "description": "Kuzan, better known by his former alias Aokiji, was one of the three Marine admirals. He was nominated by Sengoku for the position of fleet admiral. However, after losing the position to Akainu, he resigned from the Marines. <br/><br/>Kuzan is a very laid back man, showing no shock or surprise from almost anything. His lack of interest and lazy justice (as he describes his motto himself) let others often believe he can not possibly be a marine of such a high ranking. However, if he deems a situation worthy, he will take action, as shown when he created a passage to another island for a few injured castaways at Long Ring Long Land.<br/><br/>He seems to be the kindest of the three admirals, helping Tonjit at Long Ring Land to cross the ocean with the power of his Devil Fruit and even letting Nico Robin escape the Buster Call on Ohara. He seems to dislike the Shichibukai, or at least Crocodile; he said that the only reason he did not kill Luffy was that Luffy had defeated Crocodile. <br/><br/>In contrast to his fellow admiral Sakazuki, Kuzan has a sense of honour, as he keeps his word to not attack the Straw Hats after accepting a one-on-one fight with Luffy. Kuzan's moral stance is unknown, but it is likely that he follows Moral Justice. He is disgusted by Sakazuki's brutal actions in dealing with situations (such as the Ohara Incident), calling him a fool. While he may follow Moral Justice, he does understand the position his ranking puts him in, as he does not hesitate to do what is necessary for the needs of the Marines, as shown when he freezes Jaguar D. Saul after the Ohara incident, and attacked Luffy and Whitebeard during the Marineford War.<br/><br/>Aokiji was a faithful follower of the World Government. He always tried to obey orders but sometimes found his own ideals in opposition to his orders. Even as he followed his orders, he would sometimes exhibit a sense of mercy and honor that other World Government officials did not. Like many characters in One Piece (for example, Jaguar D. Saul and Smoker), after witnessing the senseless murder of many innocent people, Aokiji may have come to realise how low these events have sunk the World Government.<br/><br/>His relaxed demeanour while performing the more macabre of his duties is similar to that of Borsalino, making him one of the more complicated characters in the series. Despite not really wanting the position of fleet admiral, he was even more opposed to Sakazuki getting the position, and fought his fellow admiral rather than letting him take it. After being defeated, Kuzan chose to resign from the Marines rather than stay under Akainu's command.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/422/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/422/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/422/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/422/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/422/castings"
          }
        }
      }
    },
    {
      "id": "423",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/423"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:32.899Z",
        "updatedAt": "2017-01-22T10:58:02.474Z",
        "slug": "smoker",
        "name": "Smoker",
        "malId": 2753,
        "description": "Age: 34, 36<br/>Birthday: March 14<br/>Affliation: The Marines<br/>Title:Captain, later Commodore, currently Vice Admiral<br/>Devil Fruit: Moku Moku no Mi (Plume-Plume, Smoke-Smoke Fruit)<br/><br/>Smoker the White Hunter is a Marine. He was first introduced in Loguetown.<br/><br/>Smoker is a muscular white haired man, who carries the very distinct trait of always being seen smoking two cigars at once. He wears a large thick white and blue specialist Marine jacket which he keeps open with greenish fur lining the neck, wrists and hem. Many cigars are strapped to the jacket which has the kanji for \"justice\" written on the back of it. He carries a Seastone tipped jutte as his weapon. He also wears brown leather gloves, blue jeans with a brown belt and large military issue brown leather boots.<br/><br/>Smoker is a tough Marine, who when first introduced, was trying to track down Luffy in Loguetown. Unlike many other Marines in One Piece, Smoker does not follow the rule of Absolute Justice and follows his own brand of justice, which he later preaches to Tashigi.<br/><br/>Despite his stern, businesslike manner, he does seem to have a soft side. He also is very good friends with fellow Marine Captain Hina and former Navy Admiral Kuzan. <br/><br/>After the timeskip Smoker became an Vice Admiral and a member of the G-5 base in the new world. He also got buffer and now sports a scar on his face.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/423/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/423/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/423/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/423/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/423/castings"
          }
        }
      }
    },
    {
      "id": "424",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/424"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.041Z",
        "updatedAt": "2017-01-22T08:43:42.255Z",
        "slug": "galdino",
        "name": "Galdino",
        "malId": 3879,
        "description": "A self proclaimed brilliant strategist, Mr. 3 prides himself that his plans are supposedly flawless, and was ordered to kill the Straw Hat Pirates and decided to claim the bounty on the giants Dorry and Broggy. Mr. 3 ate the Doru Doru no Mi (Wax Wax Fruit in the English), giving him the power to produce molten wax from any part of his body. However, he can't turn himself into wax. He sabotages a sacred battle between the two giants and then captures Vivi, Nami, and Zoro creating a huge, spinning wax cake he made with his devil fruit abilities to rain wax down upon them, the desired effect being that the three will slowly be encased in wax, and suffocate to death. This would also give Mr. 3 human wax statues, as he admits he has trouble making perfect human wax figures himself. Mr. 3 was defeated at the end along with three other Baroque Works Officer Agents, Miss Goldenweek, Mr. 5, and Miss Valentines Day.<br/><br/><span class=\"spoiler\">After the defeat, he is then send to the impel down, to be held captives in the second level of Impel down. When Luffy attempt to save Ace, Luffy met him after Buggy the clown on the way to level 5 where Ace is held. Luffy freed him thinking naively he is going to help him save Ace with him. <br/><br/>But Mr. 3 had other plans; his escape plan with Buggy prioritizes more than Luffy's mission after all. He also deems Luffy's mission impossible.</span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/424/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/424/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/424/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/424/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/424/castings"
          }
        }
      }
    },
    {
      "id": "425",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/425"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.077Z",
        "updatedAt": "2017-01-22T10:39:12.459Z",
        "slug": "kumadori",
        "name": "Kumadori",
        "malId": 4784,
        "description": "Kumadori (Ã£â€šÂ¯Ã£Æ’Å¾Ã£Æ’â€°Ã£Æ’Âª, Kumadori) is one of the last members of CP9 to be revealed, and is recognizable by his large frame, huge mane of pinkish hair, and a right eye that never seems to be open. He seems to honor the samurai honor code very heavily as he comically attempts to take his own life after dishonoring himself. As he accepts the blame for nearly anything, even faults of others, this happens quite often in his appearances. Before he commits seppuku, however, he instinctively uses tekkai every time, unintentionally saving his own life.<br/><br/>He seems to have strong feelings for his deceased mother, beginning to sob, even while fighting, at the very thought of her. He claims her \"divine protection\" is the reason for his failed suicide-attempts. These dramatic statements are somewhat undercut by Oda's revelation that his mother is in fact alive, and working as an assassin. [3] He claims to dislike lies, though he seems to have no trouble with melodramatic stories. Kumadori is a sennin (Ã¤Â»â„¢Ã¤ÂºÂº, a type of hermit in Japanese mythology who can control even their body's autonomic functions, as well as live forever, similar to fellow Shonen Jump character Jiraiya of the popular series Naruto), which explains his sudden weight gain/loss as well as the ability to control his hair.<br/><br/>Kumadori is a very loud character, and utters very few sentences not written in bolded fonts and ending with exclamation marks. He has the strange habit of yelling something resembling \"YOYOI!!\" rather often. He tends to repeat or draw out syllables and words in the manner of kabuki actors. Kumadori's name most likely comes from the Japanese word kumadori (Ã©Å¡Ë†Ã¥ï¿½â€“Ã£â€šÅ , a type of makeup used for kabuki), as his features look very similar to those of kabuki actors in their makeup. His body positions (especially his penchant for holding one hand out in front of him) are also reminiscent of mie poses, and his vocal inflection is similar to that of kabuki actors. His fighting abilities seem to revolve around controlling his hair, using it to grab his enemies and attacking them. He also has a shakujÃ…ï¿½ that he occasionally uses in battle. He also has a penchant for spouting off haiku when fighting.<br/><br/>Kumadori was originally fighting with Nami, who was at a severe disadvantage. However, Chopper appeared and helped Nami (after Nami had already stolen Kumadori's key) to escape, becoming Kumadori's opponent. Despite Kumadori's advantage of being a sennin, Chopper consumed a third Rumble Ball, and his subsequent \"Monster Point\" form severely injured Kumadori and threw him all the way back to the courthouse.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/425/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/425/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/425/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/425/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/425/castings"
          }
        }
      }
    },
    {
      "id": "426",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/426"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.094Z",
        "updatedAt": "2017-01-22T08:25:55.611Z",
        "slug": "bentham",
        "name": "Bentham",
        "malId": 4875,
        "description": "Mr. 2 Bon Clay is an \"okama\", a Japanese slang term for a transvestite. He has a flamboyant attitude, and is prone to singing and dancing. His martial art style is called \"Okama Kenpo\" in the Japanese manga. Bon Clay ate the Devil Fruit, Mane Mane no Mi (Clone Clone Fruit) which allows him to transform into an exact copy of anyone he has touched. Mr. 2 Bon Clay's swans form the shape of a two. He is defeated by Sanji but is considered a friend by the Straw Hat Pirates, even aiding them in their escape from Alabasta.<br/><br/>Mr. 2 Bon Clay is the only Officer Agent in Baroque Works without a female partner. This stems from the belief that, as an okama, he fills both roles by himself. Likewise, his name is a composite of a male Baroque Works agent's number and a female agent's holiday-based name. \"Bon Clay\" is celebrated in Japan on either July 15 or August 15 because of the use of a lunar calendar. It is a Buddhist celebration found on the last day of the Bon festival, honoring the dead. Lanterns are lit, and the Bon-Odori is traditionally danced.)<br/><br/><span class=\"spoiler\">During the Impel down arc, he helps Luffy escape from there and in the end he disguised himself as the prison's co-manager and opened the gates outside so luffy can escape. He sacrificed himself to let Luffy escape. </span><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/426/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/426/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/426/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/426/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/426/castings"
          }
        }
      }
    },
    {
      "id": "427",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/427"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.129Z",
        "updatedAt": "2017-01-22T12:29:23.174Z",
        "slug": "jango",
        "name": "Jango",
        "malId": 4886,
        "description": "Seaman Recruit Jango is the first mate and hypnotist of Captain Kuro. He uses disks that double as chakrams to hypnotize people to his advantage in battle. He has a former bounty of 7,000,000 Beli. Jango usually ends up hypnotizing himself as well as his targets.<br/><br/>Jango wears strange clothes, including a long coat covered in the disks he uses to fight and hypnotize, and red-lensed heart-shaped glasses. Jango possesses the power of hypnosis which he uses with varying degrees of success. He is defeated by Usopp while attempting to kill Kaya, and later is shown in a series of cover stories. He joins the Navy and serves under Captain Hina.<br/><br/>Jango gained his powers after eating a mushroom that had grown on his chin while he was sleeping. He only ate the cap and the trunk of the mushroom still resides on his chin.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/427/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/427/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/427/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/427/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/427/castings"
          }
        }
      }
    },
    {
      "id": "428",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/428"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.165Z",
        "updatedAt": "2017-01-22T09:51:31.149Z",
        "slug": "arlong",
        "name": "Arlong",
        "malId": 4887,
        "description": "Arlong the Saw is a sawshark fishman. He was the pirate captain of the all fishman crew, the Arlong Pirates, a former member of the Sun Pirates, and the older brother of Madam Shyarly. He is known for being the main villain in the Arlong Arc and had the highest bounty in East Blue before being defeated by Monkey D. Luffy. <br/><br/>Like many other One Piece characters, he has his own unique laugh, which is \"Shahahahaha\".<br/><br/>Arlong considers humans to be inferior beings and is very cruel to them. He is keen to separate his race from humans, and is constantly stuck by this mentality that his people are superior to humans in every way. He thinks nothing of killing a town full of humans, although he seems to prefer controlling people with money and deals (like Nami and Nezumi.)<br/><br/>He has an eye for spotting exploitable talent that he can use for his goals and is an excellent planner. He spent eight years using Nami and her maps to plan his takeover of the East Blue. Nevertheless, any promise about money he makes, he keeps. The best example is when his crew urged him to keep Nami even if she brings the 100,000,000 Beli. However, even though Arlong states he can't go back on his word, he has no qualms about exploiting loopholes in his deals to unfairly get his way.<br/><br/>He is rather easy to anger, going berserk after he was attacked by Usopp and having to be dragged back to his base by his crew to prevent him from destroying the whole town. During his fight with Luffy, the boy's constant fighting back made Arlong mad, to the point where it drove him into a deep anger.Arlong himself had expected Luffy to die quickly, but his anger made him become reckless and destructive, even seriously damaging his own HQ building while attacking Luffy.<br/><br/>He has been ill-tempered since his younger years. However, he wasn't always entirely brutal. During a battle with the Marines, Arlong told Jinbe to leave the unconscious Marines alone. However, it was later shown that he had grown more arrogant over time to the point that he completely had no sympathy for humans. Tiger's death led to his hatred hitting rock bottom. He also failed to understand Fisher Tiger's reason for letting humans that they attacked live. As a result, when Arlong led his own crew and had committed murder, humans came to view him as a \"monster\". He was loathed for the actions of him and his crew. In the end, he enslaved humans just as the humans once enslaved many fishmen.<br/><br/>Though his opinions and his ideals were extreme, he displayed a high level of brotherhood with his crew and even towards Nami despite her species divide. Arlong looked after his crew members and even though he betrayed Nami, he did so because he didn't want to lose her talent. On top of this, in the final moments of the battle with Luffy, he stated that Nami was his crew member and would be forever, and while he never displayed any regard for her as a friend he was prepared to fight to keep her in the crew. If humans insulted their group, Arlong would react to the insult, and due to the high level of concern amongst his officers they would attempt to keep his temper under control. When weaker members of his crew were hurt, Arlong would seek out revenge on those who had committed the act against those crew members.<br/><br/>Ironically, Arlong is a hypocrite, having accused Koala of being raised to look down on fishmen and think of humans as better than everyone else, when Arlong looked down on humans and preached fishmen superiority himself, making him no better than the humans. Surprisingly despite his hatred of humanity according to Hatchan, Arlong would never harm his fellow fishmen no matter the circumstance. He cared for his crew to a level that when Luffy used one of them as a shield, Arlong became extremely angry.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/428/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/428/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/428/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/428/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/428/castings"
          }
        }
      }
    },
    {
      "id": "429",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/429"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.205Z",
        "updatedAt": "2017-01-22T11:53:33.646Z",
        "slug": "nojiko",
        "name": "Nojiko",
        "malId": 4888,
        "description": "Nojiko is the adoptive older sister of Nami (the two are not biologically related but were raised together by Bellemere). She plays a major part in the Arlong arc as she reveals Nami's past to the Straw Hats and helps rescue Luffy with the help of Genzo after Luffy is thrown into the ocean by Arlong with his feet stuck in a block of cement. Her right arm is covered in tattoos, which she got to help Nami not to feel ashamed of her tattoo of Arlong's pirate logo. After trying to stop Nami from attacking Captain Nezumi, a Naval officer who tries to take the money Nami raised for her deal with Arlong, Nojiko was shot by him in the back. However, she survived. In the manga, she gave her bracelet to Nami. She appears later again, and is glad that Nami looks happy in her wanted poster.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/429/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/429/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/429/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/429/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/429/castings"
          }
        }
      }
    },
    {
      "id": "430",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/430"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.241Z",
        "updatedAt": "2017-01-22T12:25:21.532Z",
        "slug": "hatchan",
        "name": "Hatchan",
        "malId": 4889,
        "description": "Hatchan (Ã£ï¿½Â¯Ã£ï¿½Â£Ã£ï¿½Â¡Ã£â€šÆ’Ã£â€šâ€œ, Hacchan, called \"Hachi\" (Ã£Æ’ï¿½Ã£Æ’ï¿½) by most characters) is an octopus fish-man. Hatchan is not very bright but a skilled swordsman, using rokutÃ…ï¿½ryÃ…Â« (\"six sword style\"). He fights with Zoro during the Arlong arc. Despite Zoro suffering a fever and severe blood loss from his unhealed wounds (which he got eariler fighting Mihawk), Hatchan is still defeated by him. Outside of battle, he is extremely helpful and friendly (though it should be noted that he can be just as cruel to humans as the other crew members are), addressing Zoro politely when they first met, and giving him a ride of a bay on his back. Later in the manga (in a title page arc that was never animated), Hatchan goes on many adventures, meeting a mermaid, that ends with him opening a floating takoyaki restaurant. <br/><br/>In Hatchan's Sea-Floor Stroll, it's revealed that Hatchan, along with Chu and Kuroobi, planned to open a takoyaki store when they were younger. His nickname Hachi could also mean eight in Japanese, a reference to him being an octopus fish-man. <br/><br/>Hatchan's name is quite strange. In the Japanese language, chan is a diminutive suffix, added to the end of someone's name, giving it the meaning of \"cute\" or \"little\". However, Hatchan insists that his name is Hatchan and that Hachi is just a nickname. When questioned on this, Oda replied that the chan is the same as the last name of \"Chan\" common in Chinese, rather than the suffix -chan. <br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/430/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/430/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/430/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/430/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/430/castings"
          }
        }
      }
    },
    {
      "id": "431",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/431"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.271Z",
        "updatedAt": "2017-01-22T11:27:14.210Z",
        "slug": "bellemere",
        "name": "Bellemere",
        "malId": 4890,
        "description": "Bellemere was Nami and Nojiko's adoptive mother, seen in a flashback during the Arlong arc.<br/><br/>Source: One Piece Wikia<br/><br/>A former Marine, Bellemere came across Nojiko and Nami in the ruins of a town in the aftermath of a great battle. She decides to leave the Marines and raise them as her daughters, in order to get away from the death and destruction of Marine life.<br/><br/><span class=\"spoiler\">When Arlong arrives at her island, Bellemere is the only person to fight back with any degree of success. However, she's caught off-guard by the fishmen's strength, and allows Arlong to kill her in exchange for Nojiko and Nami's safety.</span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/431/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/431/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/431/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/431/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/431/castings"
          }
        }
      }
    },
    {
      "id": "432",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/432"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.291Z",
        "updatedAt": "2017-01-22T12:30:07.629Z",
        "slug": "chew",
        "name": "Chew",
        "malId": 4891,
        "description": "Chew (Ã£Æ’ï¿½Ã£Æ’Â¥Ã£â€šÂ¦, ChÃ…Â«) (Choo in the English version) is an Archerfish-man. In the Japanese version, he has a habit of saying \"chu\" (an onomatopoeic kissing-noise) after each sentence. Choo is one of the more cool-headed officers in Arlong's crew (though also possibly the most violent, as he shoots a Marine Captain before he even finishes talking) and can spit water out of his mouth as if it were a bullet. He ends just about all his sentences with \"smek\". (\"chew\" in the 4kids dub) He later fights with the apparently-outmatched Usopp, but he is ultimately beaten after Usopp wears him down by running away and setting him on fire, before repeatedly hitting him over his head with his \"Usopp-Hammer\" to knock him out. <br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/432/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/432/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/432/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/432/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/432/castings"
          }
        }
      }
    },
    {
      "id": "433",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/433"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.316Z",
        "updatedAt": "2017-01-22T12:09:05.086Z",
        "slug": "genzo-d912730f-b0be-40bd-85f1-f5b9f9660666",
        "name": "Genzo",
        "malId": 4892,
        "description": "The sheriff and mayor of Cocoyashi Village (Coco Village in the 4kids version), which is Nami's home town. He is like a father figure to Nami and Nojiko since they were kids and he knew their adoptive mother, Bellemere, quite well. He also kept the town together after Arlong took over the island, making sure everyone was safe and able to pay their tax.<br/><br/>Genzo wears a pinwheel on his hat because he used it to make Nami laugh when she was a baby (this pinwheel also inspired an attack for Luffy during their fight with Arlong). He played a role in rescuing Luffy after Arlong threw him into the ocean. All of Genzo's scars are from his first encounter with Arlong when he tried to stop him from taking Nami, Arlong made Kuroobi cut every part of his body with a sword. He was also almost killed by Arlong for hoarding novelty swords, until Usopp saved him.<br/><br/>Genzo's pinwheel inspired Nami's new tattoo--a pinwheel to represent him with a tangerine to represent Bellemere. After Nami sails off with Luffy and crew, Genzo says he no longer needs his pinwheel, placing it by Bellemere's grave. The origin of the pinwheel is then revealed. Bell-Mere said that Nami cried when she saw Genzo because he looked scary, but then Genzo put his pinwheel on to make Nami laugh. It is revealed later in the manga that Luffy is very interested in the pinwheel {this inspires a new attack for Luffy, Gomu Gomu No Pinwheel}, not even noticing the Navy who are trying to find Nami, just Genzo's pinwheel. However, this could be a put down in reference to Luffy's simple-mindedness. He threatens Luffy that if he finds out that he made Nami cry, he'll come after him. However, Luffy lived up to that promise, as Nami's sister, Nojiko pointed out.<br/>Genzo appears again later, and is outraged by Nami's wanted poster, wherein she is in a bikini, saying she'll get more suitors than bounty hunters, yet has blown it up poster-sized hanging in his house.<br/><br/>Source: Wikipedia<br/>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/433/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/433/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/433/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/433/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/433/castings"
          }
        }
      }
    },
    {
      "id": "434",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/434"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.350Z",
        "updatedAt": "2017-01-22T09:36:34.362Z",
        "slug": "johnny-e0c54fcd-36ba-4cc3-8079-8b060c829efd",
        "name": "Johnny",
        "malId": 4893,
        "description": "Johnny is happy-go-lucky, much like Yosaku. Jonny tends to be the more serious of the pair, though he acts being silly around Yosaku from time to time. Johnny is also dimwitted to some extent. He also has a huge cowardly side to him, as seen when he willingly abandoned Zoro to run off to safety with Usopp.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/434/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/434/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/434/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/434/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/434/castings"
          }
        }
      }
    },
    {
      "id": "435",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/435"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.378Z",
        "updatedAt": "2017-01-22T08:39:09.708Z",
        "slug": "yosaku",
        "name": "Yosaku",
        "malId": 4894,
        "description": "Johnny's partner &amp; fellow pirate bounty hunter. Though he wields a sword, he rarely gets to show his skill with it due to the level of the pirates he encounters after meeting Luffy. He and Johnny first meet Luffy &amp; co. just after the \"Black cat pirates\" arc, when the tiny island he and Johnny are on is blasted by the Going merry while the crew is testing their new cannons. After they're both brought on board, Yosaku's bout of scurvy is cured, and they stay on the Going Merry for a while (since their boat was destroyed in the cannon blast). They tag along with the Straw Hats throughout the \"Don Krieg\" &amp; \"Arlong Park\" arcs, after which they decide to remain behind at Cocoyashi village to help out the villagers.<br/><br/>Both Yosaku and Johnny seem to know Zoro from several years before he joined the Straw Hats. In the anime, how they met Zoro is shown in a dream Zoro has.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/435/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/435/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/435/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/435/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/435/castings"
          }
        }
      }
    },
    {
      "id": "436",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/436"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.413Z",
        "updatedAt": "2017-01-22T11:59:27.358Z",
        "slug": "kuroobi",
        "name": "Kuroobi",
        "malId": 4895,
        "description": "Kuroobi is a ray-type fish-man. Kuroobi is one of the strictest members in his crew and has always been wary of Nami's supposed allegiance to Arlong. Kuroobi practices \"Fish-Man Karate\" (called \"Merman Karate\" in the now defunct 4kids dub) to fight his opponents. During the battle with the Straw Hats in the Arlong arc, he fights against Sanji whom he nearly defeats when the cook goes underwater to try and save Luffy. As a Fish-Man, Kuroobi has an advantage underwater. However, Sanji manages to force him up to dry land by breathing the air from his gills, suffocating him, and then promptly beats him into submission with his kicks.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/436/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/436/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/436/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/436/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/436/castings"
          }
        }
      }
    },
    {
      "id": "437",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/437"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.448Z",
        "updatedAt": "2017-01-22T09:57:47.218Z",
        "slug": "mohji",
        "name": "Mohji",
        "malId": 4896,
        "description": "Mohji is the first mate of Buggy's Crew. Quite pompous and at times silly, Mohji has the ability to control any animal he wishes, or so he says. He has yet to prove it in the series outside of his pet, a lion named Richie, who is more like another crew member than just a pet. Mohji usually opts to use him in battle rather than fight himself. He is, however, fast and agile, and very skilled with a whip. He is also responsible for burning things, such as the pet-food shop and the Going Merry.<br/><br/>In his first appearance, Mohji was sent by Buggy to capture Roronoa Zoro. However, Monkey D. Luffy got in his way, who eventually defeated Mohji after he burned down a pet-food shop that belonged to a recently deceased man and his still-living dog.<br/><br/>After Buggy's defeat Mohji and Cabaji fought over leadership of the group. They were equally matched, and fought for several hours. The battle ended when a sleep-walking Richie knocked them both unconscious, taking over leadership himself. However, Richie and the pirates were kidnapped by a cannibalistic group, but saved by Buggy, Alvida, Mohji, and Cabaji.<br/><br/>Mohji later participated in the attack on Loguetown. It was his job to burn down the Straw-Hat's boat, which he failed to do as soon as it started to rain. Nami and Usopp found him and Richie, but as soon as Mohji sent Richie to attack, Usopp used an egg to distract the lion. The Marines showed up, and started shooting at everyone. Mohji was able to dodge the bullets and flee the scene with the rest of Buggy's group.<br/><br/>Much later, Mohji reappeared with the group as they travel in the Grand Line and find a mysterious man named Portgas D. Ace. He was also in the TV Special that featured the One Piece characters as ninjas, and appeared in several video games. Every time Mohji appears in the series for an arc, his hairstyle changes. During the Buggy arc, his hair was shaped like a teddy bear; the Loguetown arc had him wearing a pink helmet with bunny ears sticking out; and when the group makes it into the Grand Line, his hair is shaped like a lion's mane.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/437/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/437/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/437/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/437/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/437/castings"
          }
        }
      }
    },
    {
      "id": "438",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/438"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.467Z",
        "updatedAt": "2017-01-22T10:13:40.204Z",
        "slug": "cabaji",
        "name": "Cabaji",
        "malId": 4897,
        "description": "Cabaji is the second mate in Buggy's crew as well as their primary swordsman who combines it with acrobatics (mostly on a unicycle) to fight his enemies. He fights with Roronoa Zoro no sooner than after being introduced and plays dirty by kicking Zoro's wounds whenever he has the chance. But once Cabaji is knocked off his unicycle, he is easily defeated by Zoro's 'Oni Giri' which cuts open his chest.<br/><br/>After Buggy's crew was defeated by Luffy, he fought with the 'other' first mate Mohji for the title for the next captain--both were knocked out by a sleepwalking Richie, who gained the title (though lost it just as quick). However, he returned to his former position when Buggy resurfaced.<br/><br/>During the Loguetown attack, Cabaji accompanied Buggy and Alvida to fight against the Straw Hats and Navy. However, despite wanting to have a rematch with Zoro, he didn't get a chance to do so.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/438/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/438/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/438/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/438/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/438/castings"
          }
        }
      }
    },
    {
      "id": "439",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/439"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.496Z",
        "updatedAt": "2017-01-22T10:35:59.098Z",
        "slug": "richie",
        "name": "Richie",
        "malId": 4898,
        "description": "Mohji's pet. Despite his size and fierce look he mostly acts like a kitten and has his goofy moments when he is doing nothing. He also isn't very bright and occasionally thinks about nothing but food.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/439/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/439/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/439/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/439/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/439/castings"
          }
        }
      }
    },
    {
      "id": "440",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/440"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.519Z",
        "updatedAt": "2017-01-22T11:17:27.771Z",
        "slug": "alvida",
        "name": "Alvida",
        "malId": 4899,
        "description": "Alvida is first introduced in the first episode of One Piece as a fat looking female pirate captain with freckles all over her face. Coby, a pink coloured hair boy works for her after he was captured by Alvida. She was often seen asking the quote 'Who is the most beautiful woman in the world?', and expect an answer of her name to anyone she ask regarding the question.<br/>After Alvida and her crew was defeated by Luffy, she ate the Sube Sube fruit (Smooth Smooth) that allows incoming attacks to slip through her. Her freckles also disappeared after she ate the fruit. Aside that, her figure also changed for some reason. At her second appearance in the 52nd episode, she is now portrayed as an attractive beauty. <br/><br/>After her defeat by Luffy, Alvida ends up joining forces with Buggy to take revenge on their common foe, staying on Buggy's ship all the while. She also takes charge of Buggy's crew for a while, in the short time that Buggy was captured by the Marines.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/440/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/440/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/440/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/440/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/440/castings"
          }
        }
      }
    },
    {
      "id": "441",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/441"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.553Z",
        "updatedAt": "2017-01-22T10:58:18.971Z",
        "slug": "narrator-2ac22065-ecaa-4be3-b6c4-96e7d41acde9",
        "name": "Narrator",
        "malId": 5222,
        "description": null,
        "image": null
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/441/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/441/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/441/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/441/castings"
          }
        }
      }
    },
    {
      "id": "442",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/442"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.581Z",
        "updatedAt": "2017-01-22T12:23:27.703Z",
        "slug": "apis",
        "name": "Apis",
        "malId": 5412,
        "description": "Apis is a young girl who lives on Warship Island. She ate the Hiso Hiso no Mi. She tried to guard the thousand year dragon Ryuji from the Marines on her own, but she was captured by Commodore Nelson. The Straw Hat Pirates helped her out and she was able to fulfill her duty. When offered to join the crew she declines and says that she wants to stay and protect the island.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/442/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/442/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/442/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/442/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/442/castings"
          }
        }
      }
    },
    {
      "id": "443",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/443"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.607Z",
        "updatedAt": "2017-01-22T11:20:23.113Z",
        "slug": "laboon",
        "name": "Laboon",
        "malId": 5413,
        "description": "Laboon is an extremely large whale (of comparable or greater size than the monsters in Calm Belt), native to West Blue, whom the Straw Hat Pirates encounter immediately after entering Grand Line. Fifty years earlier, Laboon had been left at the bottom of Reverse Mountain by a group of pirates who had befriended him. Since his species travels in pods, he had forged a powerful bond of friendship with these pirates, and he patiently waited for them at Grand Line's entrance. His caretaker is a doctor named Crocus, who normally mans the Lighthouse that introduces travelers into Grand Line. <br/><br/>Crocus revealed to the Straw Hat Pirates that Laboon's friends effectively abandoned him by fleeing the Grand Line through the Calm Belt. (although this may not be true as Brook described his crew as being slaughtered in the Florian Triangle) The pirates were recently revealed to be the crew of Brook the skeleton, leaving him as Laboon's only crewmate left. The old doctor has cared for Laboon ever since his friends left him. Although Laboon knows the truth about his friends, he refuses to admit to himself that they are gone. Laboon has many scars on his head from slamming into Reverse Mountain, for he believes he can destroy the mountain and return to West Blue. <br/><br/>Monkey D. Luffy, in an effort to give Laboon a renewed sense of hope, picks a fight with the whale by jamming the Going Merry's mast into his head. After the battle (which Luffy calls a draw), Luffy promises to Laboon that he will return to see him, under the guise of wanting a rematch. As a sign of this, Luffy paints the Strawhat Jolly Roger on Laboon's head, commenting that the insignia will wash away if Laboon hits Reverse Mountain further. The Straw hats depart, leaving behind two important friends. <br/><br/><span class=\"spoiler\">Recently, the only known survivor of the pirates that had abandoned him fifty years ago has been revealed to be Brook, an undead skeleton the Straw Hats met shortly before they arrived on Thriller Bark. He has currently reclaimed his shadow, so that he can exit the Florian Triangle, and return to Laboon.</span><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/443/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/443/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/443/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/443/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/443/castings"
          }
        }
      }
    },
    {
      "id": "444",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/444"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.612Z",
        "updatedAt": "2017-01-22T08:21:29.416Z",
        "slug": "mr-9",
        "name": "Mr. 9",
        "malId": 5414,
        "description": "Mr. 9 is Princess Vivi's assigned male partner during her infiltration within Baroque Works. He wears a crown decorated with nines and fights with acrobatics coupled with steel bats. He and Vivi meet the Straw Hats while trying to kill Laboon the whale for food. The Straw Hats give them a ride there later after they accidentally lose their Log Pose. After Vivi is exposed by Mr. 5 and Miss Valentines Day, Mr. 9 tries to hold them off to allow her to escape. He is defeated by Mr. 5.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/444/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/444/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/444/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/444/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/444/castings"
          }
        }
      }
    },
    {
      "id": "445",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/445"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.641Z",
        "updatedAt": "2017-01-22T10:17:56.554Z",
        "slug": "igaram",
        "name": "Igaram",
        "malId": 5415,
        "description": "Captain of the royal guards, he is Chaka and Pell's boss. He and Princess Vivi infiltrated Baroque Works and manage to become Frontier Agents in order to learn the organization's true boss and objectives. He was known as Mr. 8 by most of the Baroque Works before being exposed, and introduces himself as Igarappoi when he is first seen in Whiskey Peak. Igaram fights with a saxophone that shoots bullets when played, and he also has small guns hidden in his hair that fire when he pulls on his neck tie.<br/><br/><span class=\"spoiler\">After he and Vivi were found out, he dressed up as Vivi to act as decoy while the Straw Hats helped Vivi get back to Alabasta. But Nico Robin (Miss All Sunday at the time) blew up his ship and he was presumed dead until the end of the Alabasta arc, where he emerged alive and well in Nanohana (which appears to be what Robin intended).<br/><br/>He finally caught up with the rebellion carrying a witness, Kappa, who saw Mr. 2 Bon Clay remove his disguise as Cobra, the king of Alabasta, proof that the rebellion was started by Baroque Works and not by the faults of the king. He was again seen decoying as Vivi, during a speech to the people of Alabasta, so she could sneak away secretly to say goodbye to the Straw-Hats. Later in the Rainbow Mist Arc, he is seen placing Rainbow Mist Volume X on a shelf in Alabasta. He seems to have more than a necessary liking for wearing women&amp;#039;s clothing, and has dressed as Vivi off his own bat more than once. This could just be because of his loyalty to Vivi.</span><br/><br/>Source: Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/445/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/445/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/445/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/445/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/445/castings"
          }
        }
      }
    },
    {
      "id": "446",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/446"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.666Z",
        "updatedAt": "2017-01-22T10:13:15.143Z",
        "slug": "miss-monday",
        "name": "Miss Monday",
        "malId": 5416,
        "description": "Miss Monday is the assigned female partner to Igaram (AKA Mr. 8) at the time during his infiltration within the Baroque Works. Not much is known about her other than that she is inhumanly strong as indicated by her mass muscles and huge size. Miss Monday, along with Mr. 8, Mr. 9, Miss Wednesday (AKA Princess Vivi) and every resident on Whiskey Peak fight against Zoro. After Vivi is exposed by Mr. 5 and Miss Valentines Day, Miss Monday attempts to hold them off, claiming that Vivi is her friend. She is defeated by Mr. 5.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/446/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/446/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/446/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/446/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/446/castings"
          }
        }
      }
    },
    {
      "id": "447",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/447"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.688Z",
        "updatedAt": "2017-01-22T09:50:37.870Z",
        "slug": "miss-valentine",
        "name": "Miss Valentine",
        "malId": 5417,
        "description": "Miss Valentine is partnered with Mr. 5, and she has the power of the Kilo Kilo Fruit, which allows her change her weight to anything between 1 and 10,000 kilograms. She uses this power to crush her opponents, or to make her light enough to glide through the air using her umbrella. She is defeated on Little Garden by Nami and Nefertari Vivi.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/447/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/447/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/447/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/447/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/447/castings"
          }
        }
      }
    },
    {
      "id": "448",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/448"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.719Z",
        "updatedAt": "2017-01-22T11:10:20.336Z",
        "slug": "mr-5",
        "name": "Mr. 5",
        "malId": 5418,
        "description": "Mr. 5 is the lowest-ranked Officer Agent in the Baroque Works along with his partner, Miss Valentines Day. Like most of the Baroque Works agents, he is extremely confident. He is especially devoted to his work, and believes that friendship is a sign of weakness. Mr. 5 has a five on his coat.<br/><br/>Mr. 5 has the power of the Bomu Bomu No Mi (Bomb Bomb Fruit in the English and Boom Boom Fruit in the English Manga) which allows him to turn any part of his body into a bomb, and renders all explosive based attacks useless against him. Mr. 5 and Miss Valentines Day first meet the Straw Hat Pirates at Whiskey Peak during the Whiskey Peak Arc, then later fight them at Little Garden, where they are defeated.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/448/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/448/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/448/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/448/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/448/castings"
          }
        }
      }
    },
    {
      "id": "449",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/449"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.739Z",
        "updatedAt": "2017-01-22T10:50:20.816Z",
        "slug": "miss-goldenweek",
        "name": "Miss Goldenweek",
        "malId": 5419,
        "description": "Miss Goldenweek (Miss April Fools Day in 4Kids' English dub) partnered with Mr. 3, a wax sculptor. She hates work, is a talented painter, and can be seen constantly eating her favorite snack: rice crackers. She also appears younger than the other Baroque Works agents. She wields Color Traps, which control a person's emotions or affect their fighting abilities by painting colors upon their body. Miss Goldenweek uses these Color Traps to control Luffy, attempting to prevent him from defeating Mr. 3. She is defeated by Karoo, but appears in a cover series in which she masterminds the rescue of the captured Baroque Works agents.<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/449/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/449/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/449/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/449/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/449/castings"
          }
        }
      }
    },
    {
      "id": "450",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/450"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.762Z",
        "updatedAt": "2017-01-22T10:12:22.286Z",
        "slug": "dorry",
        "name": "Dorry",
        "malId": 5420,
        "description": "Dorry the Blue Ogre (Ã©ï¿½â€™Ã©Â¬Â¼Ã£ï¿½Â®Ã£Æ’â€°Ã£Æ’ÂªÃ£Æ’Â¼, Aooni no DorÃ„Â«) is one of the two former captains of the Giant Pirate Warrior Band from Elbaf. It is from this pirate life that he earned a bounty of 100,000,000.<br/><br/>(source: onepiece.wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/450/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/450/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/450/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/450/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/450/castings"
          }
        }
      }
    },
    {
      "id": "451",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/451"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.781Z",
        "updatedAt": "2017-01-22T10:10:03.890Z",
        "slug": "brogy",
        "name": "Brogy",
        "malId": 5421,
        "description": "Brogy the Red Ogre (Ã¨ÂµÂ¤Ã©Â¬Â¼Ã£ï¿½Â®Ã£Æ’â€“Ã£Æ’Â­Ã£â€šÂ®Ã£Æ’Â¼, Akaoni no BurogÃ„Â«) is one of the two legendary giants who fight an endless battle on Little Garden, an island in the Grand Line. Each giant has a bounty of 100,000,000 on their heads.<br/><br/>(source: onepiece.wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/451/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/451/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/451/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/451/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/451/castings"
          }
        }
      }
    },
    {
      "id": "452",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/452"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.805Z",
        "updatedAt": "2017-01-22T10:15:53.973Z",
        "slug": "wapol",
        "name": "Wapol",
        "malId": 5422,
        "description": "King Wapol is the former ruler of the Drum Empire, later renamed Sakura Kingdom. He ate the Baku Baku no Mi (Ã£Æ’ï¿½Ã£â€šÂ¯Ã£Æ’ï¿½Ã£â€šÂ¯Ã£ï¿½Â®Ã¥Â®Å¸, Munch Munch Fruit), which allows him to eat virtually anything and take on its properties. Wapol uses this power many times against Monkey D. Luffy in acts such as chomping his two advisers into a single warrior, or shooting bombs from his \"Baku Baku Factory\" pistol arms. He even tries to eat all the weapons inside his massive armory room to turn himself into a superweapon. Though, Nami manages to steal the key from him when Wapol catches her.Luffy also chases him to a room after chessmarimo is defeated where he reveals a large cannon called the \"Bre King Royal Drum Crown VII Cannon\" (\"mega monster seven barrel super shot\" in the dub). Although, when he was about to shoot Luffy, he realized that it was jammed by a snowbird nest. Probably the most shocking thing about Wapol is that he was able to swallow himself, and munch away all his excess body fat, turning him into an extra skinny form when he found himself too big to follow Nami through a small doorway. He brags a lot about being the king of Drum Island. Wapol is blasted far away from Drum Island by Luffy's Gomu Gomu No Bazooka/Gum Gum Bazooka and soon lands in a forest village. He wakes up and eats everything in sight transforming to whatever he eats. He soon starts making toys out of what he eats in which the village children are entertained with. A man sees this and offers Wapol a job. Wapol soon accepts and after making many toys becomes the CEO of a gigantic toy corporation and is now dating miss universe.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/452/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/452/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/452/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/452/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/452/castings"
          }
        }
      }
    },
    {
      "id": "453",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/453"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.849Z",
        "updatedAt": "2017-01-22T11:12:25.991Z",
        "slug": "dalton",
        "name": "Dalton",
        "malId": 5423,
        "description": "Dalton used to be a guard who served under King Wapol, but was opposed to Wapol's treatment of his subjects. He was seen with Wapol in Alabasta in a meeting with Princess Nefertari Vivi's father. He was inspired to rebel by Hiruluk. After seeing Hirluk's noble sacrifice, he turned against Wapol, but was subdued and thrown in prison, constantly mocked by Wapol and his henchmen, Chess and Kuromarimo. After Wapol abandoned his kingdom when Blackbeard invaded, Dalton took charge and kept the island from falling into disarray, soon gaining the trust of the people.<br/><br/>When Monkey D. Luffy and his crew came to Drum Island in search of a doctor to cure Nami of her illness during the mission to get Princess Nefertari Vivi to Alabasta Kingdom, they encountered Dalton and some men who thought they were here to rob the island. When asked about a doctor, the only one who could heal Nami was a witch named Dr. Kureha.<br/><br/>Even after Wapol returned and once again subdued him, the people and even the top 20 doctors continued to help out Dalton. He was later seriously wounded by Wapol because he defended the townsfolk from arrows lauched by one of Wapol's bodyguards. And he in turn then, even almost going to extreme measures such as planning to blow up Wapol's castle. Luckily, Luffy defeated Wapol and knocked him off the island, after which the people of Drum elected Dalton as their new king and renamed the island, Sakura Kingdom (inspiried from the special chemical created by Hilruk, which turned the snow pink).<br/><br/>He appears later in chapter 440, where he shows Doctor Kureha the new bounties of the Straw Hat Pirates. He doesn't live in the castle, preferring to live in the village.<br/><br/>He has eaten the Devil Fruit known as the Ushi Ushi no Mi, Model: Bison (Ã£â€šÂ¦Ã£â€šÂ·Ã£â€šÂ¦Ã£â€šÂ·Ã£ï¿½Â®Ã¥Â®Å¸ Ã£Æ’Â¢Ã£Æ’â€¡Ã£Æ’Â«Ã©â€¡Å½Ã§â€°â€º(Ã£Æ’ï¿½Ã£â€šÂ¤Ã£â€šÂ½Ã£Æ’Â³) Cow Cow Fruit, Model Bison) which gives him the ability to transform into a bison and into a half human/half bison form that resembles a minotaur. In the English anime the fruit is called the \"Ox Ox Fruit\" and the animal he turns to is an Ox.<br/><br/>Source: Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/453/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/453/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/453/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/453/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/453/castings"
          }
        }
      }
    },
    {
      "id": "454",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/454"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.883Z",
        "updatedAt": "2017-01-22T09:55:14.815Z",
        "slug": "iceburg",
        "name": "Iceburg",
        "malId": 5750,
        "description": "The president of the Galley-La company, Iceburg (Ã£â€šÂ¢Ã£â€šÂ¤Ã£â€šÂ¹Ã£Æ’ï¿½Ã£Æ’Â¼Ã£â€šÂ°, AisubÃ„ï¿½gu?) is currently 38 years old. He is loved by the people of Water 7, especially by all of his workers. They enjoy his company and often ask for his opinion and input on anything having to do with building ships.<br/><br/>Iceburg at times seems to have two different personalities. Sometimes, he acts in a very childish way, canceling all of his meetings so that he can show people around, refusing to meet with people because he doesn't like them, finding animals on the ground and taking care of them, and other such behaviors. He currently has a mouse that he named \"Tyrannosaurus\". However, when the time comes, he can be very serious, and it becomes clear that his childishness is only when he is relaxed.<br/><br/>Iceburg was the holder of the plans to Pluton for four years after Tom's death. After those four years, he secretly gave them to Franky, Tom's other apprentice that Iceburg had known since the two were children. However, as this was done in secret, the government still believes that Iceburg is in possession of the plans. As such, some officials come to try and get them from him on a regular basis.<br/><br/>Iceburg also believed that Nico Robin deserved death because she was the only person alive who could decipher the ancient Poneglyphs that could revive Pluton. He tries to kill her during the Water 7 arc, but later believes that he was wrong about her and that she is a good person.<br/><br/>The recent Aqua Laguna and its devastating impact on Water 7 gave Iceburg the desire to make Water 7 into a boat and float it on the water. When talking to Franky, Iceburg gave out Tom's famous quote, \"With a DON!\". Franky agreed that the phrase suited Iceburg.<br/><br/> * Iceburg was recently voted the 19th most popular character in One Piece.<br/> * According to a Volume 43 SBS, Iceburg's birthday is January 3rd. This is because ai is the pronunciation of the English letter \"i\", which looks like the number one. Su is the first part of the Japanese pronunciation of the word \"three\" (surÃ„Â«). Put together, these make Aisu (Ice), the first part of Iceburg's name.<br/> * Despite the fact that Eiichiro Oda has spelled his name as \"Iceburg\" multiple times, this isn't always used. Many fans prefer the name \"Iceberg\". The anime itself spelled the name as \"Icebarg\" once, while Oda himself wrote it as \"Iceberg\" in a recent fan poll.<br/> * Occasionally, he says â€œnmaaâ€ before his sentences. It seems he uses it as an ancillary word to express his frustration; similar to the word â€œwellâ€.<br/>Information - <a href=\"http://www.wikipedia.org\" rel=\"nofollow\" target=\"_blank\"></a><a href=\"http://www.wikipedia.org\" rel=\"nofollow\" target=\"_blank\">http://www.wikipedia.org</a>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/454/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/454/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/454/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/454/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/454/castings"
          }
        }
      }
    },
    {
      "id": "455",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/455"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.910Z",
        "updatedAt": "2017-01-22T11:27:43.417Z",
        "slug": "califa",
        "name": "Califa",
        "malId": 5910,
        "description": "Califa was introduced as the secretary of Iceberg in the Galley-La company, but it was not more than a cover to spy him and manage to find the whereabout of Pluton's blueprints. Califa is an outspoken feminist, she considered any offense of her superiors as \"sexual harassment\". Califa has eaten the Awa Awa fruit, that gives her the powers to become a soap woman. <br/><br/>(Source: Pirateking)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/455/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/455/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/455/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/455/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/455/castings"
          }
        }
      }
    },
    {
      "id": "456",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/456"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.931Z",
        "updatedAt": "2017-01-22T10:56:10.162Z",
        "slug": "kaku",
        "name": "Kaku",
        "malId": 6183,
        "description": "Appearance: Water 7 Arc - ep 230 as first appearance<br/><br/>Kaku, is first seen as one of the five foremen of Galley-La Company's Dock One and specializes in mechanics diagnostics and housecalls. It was Kaku that inspected the Going Merry and informed the Straw Hats that it was broken beyond repair.<br/>He has strong legs which help him in running fast and jumping for great distance over the cityscape in order to finish ships' checkups quickly.<br/><br/><br/><span class=\"spoiler\"><br/>He is also a member of the CP9, who have the power of the Ushi Ushi No Mi Model: Giraffe (Cow Cow Fruit Model: Giraffe) which also reflects his favorite animal, the giraffe, as stated when he is made fun of his devil fruit power.<br/>Later, before uncovering his mask, he uses a technique called Storm Leg and cracks the wall that Luffy got traped in.. which shows how strong his legs are.<br/><br/>Although he is one of the CP9, it seems he has a sense of honor and adventure, enough to match Luffy's which is clearly seen at the time of his defeat, he remembers the fun he had as a carpenter and flying through the cityscape.<br/></span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/456/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/456/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/456/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/456/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/456/castings"
          }
        }
      }
    },
    {
      "id": "457",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/457"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.956Z",
        "updatedAt": "2017-01-22T12:06:33.926Z",
        "slug": "chimney",
        "name": "Chimney",
        "malId": 6496,
        "description": "Chimney is the hyperactive granddaughter of Sea Train conductor Kokoro, and owner of the rabbit, Gonbe (a rabbit that thinks it's a cat). She takes a liking to the Straw Hat Pirates instantly when the crew meets her outside of Water Seven. Franky called her \"shrimp\". She also tends to notice things that others cannot, such as when she spotted Luffy wedged between two buildings (which is where he landed after Rob Lucci knocked him out of Galley-La Corporation Headquarters) or how she managed to find secret passageways in the Tower of Justice at Enies Lobby. She, along with Gonbe, later sneak aboard the prototype Sea Train, Rocketman, and accompany the Straw Hats, Franky Family, and Galley-La foremen to Enies Lobby. And later helped Luffy find the secret passageway that Spandam, Lucci and Robin took on the way to the Gate of Justice.<br/><br/>As Kokoro is revealed to be a mermaid, it is possible that Chimney, being her granddaughter, may have latent mermaid abilities of her own. Although Chimney doesn't seem to have any mermaid characteristics, she was able to save Luffy, who is 3 times her size, from drowning off screen while resisting what must have been an overwhelming current from the several whirlpools in the sea in front of the Gate of Justice.<br/><br/>Currently, she is in Water Seven. In the Volume 45 SBS, Oda revealed that Chimney is indeed 1/4 mermaid, and is thus an abnormally good swimmer.<br/>Source - Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/457/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/457/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/457/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/457/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/457/castings"
          }
        }
      }
    },
    {
      "id": "458",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/458"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.976Z",
        "updatedAt": "2017-01-22T11:13:44.197Z",
        "slug": "spandam",
        "name": "Spandam",
        "malId": 6551,
        "description": "Spandam is the leader of CP9, and the former leader of CP5. As the leader of CP5 he attempted to retrieve the blueprints of the weapon Pluton from the shipwright Tom. He failed, though Tom was imprisoned as a result of Spandam's actions. As the leader of CP9, he ordered the capture of Franky and Nico Robin, and had them taken to Enies Lobby. Spandam is defeated by Nico Robin, who breaks his back while the Straw Hat crew flee the Bridge of Hesitation. He owns a sword, \"Funk Freed\" (Ã£Æ’â€¢Ã£â€šÂ¡Ã£Æ’Â³Ã£â€šÂ¯Ã£Æ’â€¢Ã£Æ’ÂªÃ£Æ’Â¼Ã£Æ’â€° FankufurÃ„Â«do), which \"ate\" the Devil Fruit, Zou Zou no Mi (Ã£â€šÂ¾Ã£â€šÂ¦Ã£â€šÂ¾Ã£â€šÂ¦Ã£ï¿½Â®Ã¥Â®Å¸ Elephant Elephant Fruit), giving it the ability to transform into an elephant.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/458/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/458/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/458/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/458/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/458/castings"
          }
        }
      }
    },
    {
      "id": "459",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/459"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:33.995Z",
        "updatedAt": "2017-01-22T10:38:24.608Z",
        "slug": "pandaman",
        "name": "Pandaman",
        "malId": 6865,
        "description": "Pandaman is a joke character created by the author, EiichirÃ…ï¿½ Oda, whose appearance is that of a muscle bound figure with a panda face for a head (whether this is a mask or his real face remains to be seen). He makes numerous background appearances throughout the series for the viewer to try and spot.<br/><br/>Pandaman was originally created for the book 77 Mysteries of Kinnikuman. He originated from Tibet and age is unknown. He is 200 cm (6'6\") tall, weighs 122kg (270 lbs), and has a Super Power Rating of 3,300,000. His mortal blow techniques: Bamboo Leaf Panda Drop and Giant Panda Deathlock. His Explanation: Abandoned in a bamboo thicket as an infant, Panda Man was raised by Giant Pandas. (all of these mentioned are not seen in the One Piece manga or Anime, and as such it should be taken with a grain of salt.) He is an Akuma ChÃ…ï¿½jin who resolved to become strong because when he told people he had seen Kaguya-Hime, they didn't believe him and picked on him. (Kaguyahime was a princess who was found inside a bamboo stump, according to Japanese legends.)<br/><br/>According to Oda, Pandaman is a rich guy living on a certain island.[9] He is often seen in the same panel as one of the Tomato Gang, a debt collector on the lookout for Pandaman, trying to collect the money Pandaman owes (which is why Pandaman is often seen running away on appearances).<br/><br/>Pandaman's bounty is revealed to be at least more than 3,333,333 beli during the Anime Filler Arc Ice Hunter on Episode 326, as Kanpaccino's hand blocks the entire number.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/459/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/459/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/459/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/459/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/459/castings"
          }
        }
      }
    },
    {
      "id": "460",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/460"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.005Z",
        "updatedAt": "2017-01-22T12:22:52.434Z",
        "slug": "hogback",
        "name": "Hogback",
        "malId": 7455,
        "description": "Dr. Hogback is a world famous doctor, who according to Chopper saved as many people as there are stars in the sky. One day he disappeared from the public eye, causing turmoil in the medical community. Nami, Usopp, and Chopper meet him on Thriller Bark, and he explains to them that he is researching the nature of life and death using the zombies on the island. <br/><br/><span class=\"spoiler\">This is later exposed as a lie when the crew discovers that Hogback himself created the zombies, and is a crew mate of Gecko Moria, who breathes life into Hogback's zombies with the shadows he steals, transferring the fighting ability and personality of the shadow's former owner into the body. He is later seen meeting with Gecko Moria, Perona and Absalom concerning the creation of Zombie #900 and the removal of Luffy's shadow. Hogback faced off against Chopper, who, as a doctor, resents his experiments in zombification for being intended for personal gain rather than the progress of medical science. However, much to Chopper and Robin's dismay, Hogback had prepared Jigoro and Sanji's zombie for the battle to come. After Chopper and Robin being defeated, Hogback and Chopper have a conversation, where Hogback reveals that he never cared about saving lives and the reason he went into hiding was because so many people were coming to him seeking treatment, and that he became a doctor only for the money. Robin outsmarts him by telling him to order Jigoro and Penguin to jump out the window. After facing the betrayal of his beloved zombie version of Cindry, Chopper and Robin prepare to finish him off with a suplex wrestling attack, but the rampage by the massive Oz prevents them from finishing the attack. As Hogback tries to speak with the giant zombie, Oz squishes him under his massive foot. It's shown, however, in chapter 483 that Hogback somehow survived from Oz's attack. </span><br/>Like many other characters in One Piece, Hogback has a unique laugh (fosfosfosfos).<br/><br/>Many members of Thriller Bark seem to be based on old Horror movie character types; Hogback seems to be based on mad scientists, in particular Dr. Frankenstein.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/460/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/460/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/460/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/460/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/460/castings"
          }
        }
      }
    },
    {
      "id": "461",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/461"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.020Z",
        "updatedAt": "2017-01-22T09:39:23.279Z",
        "slug": "perona",
        "name": "Perona",
        "malId": 7467,
        "description": "Nicknamed the \"Ghost Princess\", Perona is a girl dressed in Gothic Lolita style and a commander in the army of Gecko Moria on his island-ship of Thriller Bark. She is also the commander of Perona Wonder Garden, where an army of animal zombies live and protect her. She looted the Thousand Sunny with some zombies and later took on guard duty while Absalom was away attempting to marry Nami. She cannot stand anything that she feels is not cute, such as insects.<br/><br/>Perona has eaten the Horo Horo no mi (Ghost Ghost fruit) which allows her to create several ghostly apparitions. The ghosts can pass through someone to cause them to go into a sort of induced depression.<br/><br/>Trivia<ul>-Like many other characters in One Piece, Perona has a unique laugh (horohorohoro, which contains the word horo, meaning ghost. It is also the name of her devil fruit).<br/>-Perona's dream is to have her own country made up of cute zombie animals with her as their leader.<br/>-Perona had no knowledge of Brook nor about the incident that occurred five years ago when he first appeared because she slept through the entire incident, scolding Kumashi when he tried to alert her.<br/>-Many members of Thriller Bark seem to be based on old Horror movie character types; Perona is based off of ghosts.</ul><br/><br/>Source: Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/461/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/461/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/461/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/461/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/461/castings"
          }
        }
      }
    },
    {
      "id": "462",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/462"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.040Z",
        "updatedAt": "2017-01-22T12:07:05.710Z",
        "slug": "wiper",
        "name": "Wiper",
        "malId": 7644,
        "description": "Wiper is the leader of the Shandian warriors fighting to take Upper Yard back from Enel, he fights with a Burn Bazooka. He is a direct descendant of Calgara, inheriting his violent tendencies. Wiper is very rough around the edges and has always hated both the Skypieans (despite Gan Fall's best efforts to attain peace between the two people during his time as \"god\") and anybody from the seas. He fought against Monkey D. Luffy during the survival game yet their match ended in stalemate. Later, he, along with Nico Robin, Roronoa Zoro, Nami, Enel, and Gan Fall, survive Enel's survival game, but Enel defeats Wiper with his Goro Goro powers when Wiper refuses to join him. Wiper uses Seastone and Reject Dial, a powerful Dial weapon that causes great damage to both the enemy and the user, for the kill. However, Enel simply uses his powers to restart his own heart and strikes the Shandian warrior down once more. Later he uses it for a third time that day-he supposedly should have died after the second use-to help the Straw Hats knock over Giant Jack so Luffy can reach Enel's ship during the climax of the Skypiea Arc. After Enel's defeat, Wiper sees peace finally come between the Shandians and the Skypieans. Wiper fights using a Burn Bazooka and a Reject Dial, though he is skilled at close combat, mainly involving the use of Skate-type Wavers to boost his kicks. Currently, he's helping to rebuild the Shandian's village with the others.<br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/462/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/462/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/462/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/462/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/462/castings"
          }
        }
      }
    },
    {
      "id": "463",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/463"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.082Z",
        "updatedAt": "2017-01-22T11:06:30.909Z",
        "slug": "paulie",
        "name": "Paulie",
        "malId": 8503,
        "description": "Appearance:<br/>Paulie is rarely without a cigar in his mouth or his flame detailed denim jacket. (Though in the Post-Enies Lobby Arc he wore a black jacket emblazoned with roses and chains.) His hair is blond and slicked back on his head while wearing a pair of orange goggles on top. He's usually seen frowning.<br/><br/><br/>Personality:<br/>Paulie is shown as the closest to and most trusted by Iceburg. He also shows a different outlook on the way many female characters in One Piece dress. Unlike most other characters such as Sanji, Paulie often becomes outraged at how much body women such as Nami and Kalifa show off when they are in the company of men.<br/><br/>When he is first introduced, he tries to steal two suitcases full of money from Luffy to pay off his gambling debts. Though he is thwarted by Lucci, he still asks for 10% as a service fee.<br/><br/><br/>Fighting Style:<br/>Paulie has a unique fighting style; a complicated use of ropes that appear from under his sleeves. The amount of rope he carries is absurd, measuring hundreds, if not thousands of meters as he was actually able to make a huge, complex rope-work in a split-second to keep not only himself, but also the entire Franky Family, their Kingbulls, Oimo, and Kasshii from falling into the huge pit in Enies Lobby. He also boasts that the Galley-la rope he carries never breaks no matter what loads it carries.<br/><br/>When he attacks, the ropes generally snake their way out his sleeve and wrap around the target. <br/><br/><br/>History:<br/>During the opening day of the Puffing Tom, a young Paulie was seen attending it's coronation.[2] Inspired by this event, Paulie decided to become a shipwright. He then grew up and joined the Galley-La Company. He then became one of the company's top foremen.<br/><br/>Paulie first appeared to the Straw Hats as one of the five Galley-La foreman of Dock 1 in Water 7, specialising in the mast and rigging.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/463/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/463/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/463/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/463/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/463/castings"
          }
        }
      }
    },
    {
      "id": "464",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/464"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.112Z",
        "updatedAt": "2017-01-22T10:11:23.661Z",
        "slug": "pell",
        "name": "Pell",
        "malId": 9098,
        "description": "Pell is one of the commanders of the Alabastan guard and the strongest fighter in Alabasta. He ate the Tori Tori no Mi, Model: Falcon, Bird Bird Fruit, Model Falcon, called the \"Tweet Tweet Fruit\" in the English anime) and thus can transform into a falcon, and has earned him the kickname \"Peregrine Falcon Pell\" due to his bird powers. The fruit is apparently one of five that have been discovered that give the user the ability to fly. Since the fruit is a Zoan type, he has 3 types of transformations meaning that he can turn into a falcon or a man/falcon hybrid, as well as maintain his natural human form.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/464/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/464/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/464/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/464/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/464/castings"
          }
        }
      }
    },
    {
      "id": "465",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/465"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.200Z",
        "updatedAt": "2017-01-22T12:14:20.258Z",
        "slug": "gin-b4969173-e9d4-4387-a3fa-2467598130b1",
        "name": "Gin",
        "malId": 9321,
        "description": "Gin is fiercely loyal to Don Krieg, carrying out whatever orders he may be given from him no matter how inhumanly brutal or ruthless without protest or hesitation, thus earning himself the alias of \"Gin the Demon Man.\"<br/><br/>This is partly due to a great fear of Krieg, which is evidenced when he obeys his orders to throw away his gas mask and breathe the deadly MH5 poison gas because he fears Krieg's wrath for disobeying more than death itself.<br/><br/>However, unlike Krieg, Gin has some sense of honor inside him, being unable to bring himself to kill Sanji, the very first person to ever show him kindness (by saving him from starvation).<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/465/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/465/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/465/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/465/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/465/castings"
          }
        }
      }
    },
    {
      "id": "466",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/466"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.228Z",
        "updatedAt": "2017-01-22T09:53:12.344Z",
        "slug": "carne",
        "name": "Carne",
        "malId": 9322,
        "description": "Carne is one of the main cooks from the floating restaurant ship, Baratie, and is good friends with Patty since both applied for restaurant cooks together. He and Patty became very essential in defending the Baratie when Don Krieg attempted to take the restaurant by force.<br/><br/>Like most of the Baratie's cooking staff, Carne prides himself on being a fighting chef; when the restaurant comes under attack by the Krieg armada, he and the other chefs take up arms to defend it. He fights with a large extended knife.<br/><br/>In the 4Kids dub, Carne is given a very heavy Mexican accent not unlike Cheech Marin.<br/><br/>Carne is an Italian, Spanish and Portuguese word for Meat.<br/><br/>Source: Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/466/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/466/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/466/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/466/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/466/castings"
          }
        }
      }
    },
    {
      "id": "467",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/467"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.253Z",
        "updatedAt": "2017-01-22T10:57:36.710Z",
        "slug": "marco-635005a3-e733-4b23-a8b0-db0321e1eee0",
        "name": "Marco",
        "malId": 9323,
        "description": "As commander of the first division of the Whitebeard Pirates, Marco has authority over the lower-ranking subordinates. In addition, he is also one of the top four commanders of the Whitebeard Pirates, making him one of the top four fighters on board under Whitebeard himself.<br/><br/>He is capable of retaining consciousness despite the powerful Haki of Shanks, a Yonkou. He has incredible reflexes, as he is able to instantly respond to Kizaru's light-speed movement and attacks to protect Whitebeard. He was also able to touch Kizaru, who is normally intangible due to his Logia ability. This may indicate that Marco is capable of using Haki.<br/>Marco possesses super-human strength, as shown when he kicked Kizaru down to the ground at extreme speed, however it is unclear if it's natural or comes from the fact that he is a zoan-user.<br/><br/>Marco ate a Devil Fruit referred to as a Mythical Zoan that turns him into a Phoenix. This first and foremost gives Marco increased speed and flight, as well as the possibility of launching aerial attacks. Along with being able to transform into a blue phoenix, the fruit allows him to regenerate any wounds with fire. It is a power that is said to be even rarer than Logia. The fruit gave him his nickname: Marco the Phoenix. Marco has more control over his Devil Fruit than any other Zoan-user to date; it's so great that he can change just some limbs while the rest of the body remains human.<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/467/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/467/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/467/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/467/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/467/castings"
          }
        }
      }
    },
    {
      "id": "468",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/468"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.275Z",
        "updatedAt": "2017-01-22T10:41:41.200Z",
        "slug": "lafitte",
        "name": "Lafitte",
        "malId": 9327,
        "description": "Lafitte is the Blackbeard pirate crew's navigator<br/><br/>He used to be a policeman in West Blue, but he became a pirate after being exiled from the police force and banned from the West Blue for being excessively violent and cruel. He is incredibly pale and sickly looking, yet is very stealthy and tap-dances while he walks.<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/468/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/468/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/468/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/468/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/468/castings"
          }
        }
      }
    },
    {
      "id": "469",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/469"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.295Z",
        "updatedAt": "2017-01-22T11:19:35.336Z",
        "slug": "morgan-5565f4ed-0fef-4b98-81fa-c119ee103577",
        "name": "Morgan",
        "malId": 9333,
        "description": "Captain Morgan, called \"Axe-Hand Morgan\" since he literally has an axe for a right arm, is the first Marine officer of significant rank to be seen in the series. <br/><br/>Morgan is a very tall, intimidating man with white-blond hair and a steel jaw. As his nickname suggests, his right hand is replaced by a huge steel axe, the handle of which seems to go right through his forearm. Like most marines of high rank in the series, he wears a large, billowing coat like a cape. He can also normally be seen smoking a cigar. <br/><br/>Three years ago, Morgan looks much like he does in the present storyline, except without the axe hand and the metal jaw. He was also of a slimmer build than in the present storyline. <br/><br/>Prior to \"capturing\" Kuro, Morgan seemed to be a brave man who was not afraid of death. After his promotion, Morgan was corrupted by his power and became who he is today. <br/><br/>When Morgan is first introduced, he is governing over the small island of Shell Town, where his Naval base is located. Yet he is ruling by fear, abusing his rank to make people pay taxes, and even going as far as killing his own men if they do not obey his commands. He has a very spoiled son named Helmeppo, who is just as bad at using his father's rank to get what he wants from the island's inhabitants. Morgan shows no sort of fatherly love for Helmeppo, even stating that Helmeppo was a worthless son not even worth hitting. <br/><br/>Morgan's obsession with rank is proven in his battle against Luffy, where, despite not being able to to land a single blow on the rubberman (and having taken several), he would not accept defeat. <br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/469/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/469/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/469/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/469/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/469/castings"
          }
        }
      }
    },
    {
      "id": "470",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/470"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.321Z",
        "updatedAt": "2017-01-22T11:28:13.036Z",
        "slug": "oars",
        "name": "Oars",
        "malId": 9561,
        "description": "The 'Special Zombie' known as Oars is the 900th zombie created by Dr. Hogback for Gecko Moria. His physical appearance is that of a massive, horned creature even larger than a normal giant. In his past life he was known as 'the Demon of the Frozen Land', having conquered and mercilessly ruled over many countries and islands over five-hundred years ago. His 'rebirth' as a zombie is an event of great importance to the crew of Thriller Bark. In order to make Oars the strongest zombie ever created, Gecko Moria implants the shadow of Straw Hat Luffy into the zombie's body.<br/><br/>Having Luffy's shadow in his body, Oars's attacks have names similar to Luffy's moves (Gomu Gomu no Scythe, Gomu Gomu no Volcano). Though he is initially incapable of stretching his body, he gains this ability when Gecko Moira takes control of his body. Despite his immense size, Oars is extremely fast, moving so quick that he almost disappears for an instant before unleashing an attack. Making matters worse, small doses of salt have no effect on him because of his size.<br/><br/><span class=\"spoiler\">Oars is ultimately defeated by the combined efforts of the entire Straw Hat crew, after several unsuccessful attempts. He is killed when Gecko Moria absorbs the shadows of all of the Thriller Bark zombies.</span>",
        "image": {
          "original": "https://media.kitsu.io/characters/images/470/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/470/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/470/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/470/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/470/castings"
          }
        }
      }
    },
    {
      "id": "471",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/471"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.329Z",
        "updatedAt": "2017-01-22T09:34:29.927Z",
        "slug": "yasopp",
        "name": "Yasopp",
        "malId": 9562,
        "description": "Sniper of the Red Haired Pirate Crew. Yasopp is a gifted sharp-shooter said to be capable of shooting the legs off an ant at 100 feet without harming the rest of it. He is the father of Usopp and was one of Luffy's favorite members of the Red-Haired pirates.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/471/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/471/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/471/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/471/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/471/castings"
          }
        }
      }
    },
    {
      "id": "472",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/472"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.354Z",
        "updatedAt": "2017-01-22T08:45:54.647Z",
        "slug": "absalom",
        "name": "Absalom",
        "malId": 9655,
        "description": "Nicknamed Absalom of the Graveyard (Ã¥Â¢â€œÃ¥ Â´Ã£ï¿½Â®Ã£â€šÂ¢Ã£Æ’â€“Ã£â€šÂµÃ£Æ’Â­Ã£Æ’ , Hakaba no Abusaromu), he is one of Gecko Moria's henchmen. He commands the soldier sect of zombies on Thriller Bark, and his subordinates have a tendency of making fun of his perverted nature, referring to him as \"Erosalom\" (Perv-salom). Although first revealed as an invisible man, his true form is that of a man with various animal parts surgically implanted onto his person by Dr. Hogback. These animal parts include a lion's face, the thick skin of an elephant and the condensed muscles of various bears and gorillas. He has eaten the Suke Suke no mi (Clear Clear fruit), which allows him to turn invisible on demand and to turn objects or persons invisible if he touches them. He uses this ability to conceal a pair of bazookas strapped to his arms, which allows him to fire blasts which seem to to come from nowhere. The blasts are incredibly powerful, capable of mowing down trees and setting fiery explosions. Like many other characters in One Piece, Absalom has a unique laugh, his is a growl-like garurururu.<br/><br/>Source: Wikipedia",
        "image": {
          "original": "https://media.kitsu.io/characters/images/472/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/472/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/472/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/472/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/472/castings"
          }
        }
      }
    },
    {
      "id": "473",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/473"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.364Z",
        "updatedAt": "2017-01-22T09:44:41.933Z",
        "slug": "kaya-ba39234f-1cf6-4fb8-8bfe-918b1fd8b068",
        "name": "Kaya",
        "malId": 9880,
        "description": "Kaya (Ã£â€šÂ«Ã£Æ’Â¤) is a rich girl who gets an inheritance after her parents died. Kaya becomes sickly, and her caretaker Klahadore often tends to her. (Klahadore was found three years earlier by her father, practically dead on their doorstep. Kaya's father took pity and offered the man a job.) Secretly, the town liar--Usopp--climbs a tree outside her window and tells her tall tales that make her laugh and feel better. However, Klahadore is very disapproving of this and eventually kicks Usopp out and makes Kaya believe that he is a bad influence.<br/><br/>One day, Usopp listens in on a conversation between Klahadore and Jango, a hypnotist. Klahadore is really Captain Kuro and reveals that he plans to kill Kaya for her money--the last three years he has been gaining the trust of Kaya and the Village. Usopp tries to warn Kaya about the plot, but Kaya believes that he is lying; she rebukes him when he insists that he is telling the truth. She eventually learns the truth, and after Kuro is defeated, she gives the Straw Hats the Going Merry.<br/><br/>She was recently seen in manga chapter 440, discovering Usopp's Sogeking bounty poster. She and the former Usopp Pirates knew it was Usopp, just by looking at his nose. Kaya comments that she needs to continue to learn more about medicine as she says that when the day comes that Usopp returns he will probably be hurt from all his adventures and she wants to help him. However, his \"pirate crew\" vow to beat him up if Usopp ever makes Kaya cry.<br/><br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/473/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/473/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/473/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/473/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/473/castings"
          }
        }
      }
    },
    {
      "id": "474",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/474"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.412Z",
        "updatedAt": "2017-01-22T12:28:22.378Z",
        "slug": "keimi",
        "name": "Keimi",
        "malId": 10101,
        "description": "Birthday: November 3<br/>Current job: Takoyaki store employee<br/>Dream job: Designer<br/><br/>A mermaid who appeared in the Hatchan's Sea-Floor Stroll mini-series. She first appears after being saved by Hatchan from inside the mouth of a big fish alongside her Starfish friend. She soon becomes friends with Hatchan and is later rescued again by him after she is kidnapped by some old Fish-Men friends of his. In the final part of the mini-series she was at the grand opening of his floating takoyaki restaurant.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/474/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/474/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/474/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/474/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/474/castings"
          }
        }
      }
    },
    {
      "id": "475",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/475"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.425Z",
        "updatedAt": "2017-01-22T09:50:38.879Z",
        "slug": "gaimon",
        "name": "Gaimon",
        "malId": 10147,
        "description": "Gaimon is a character that gets his body imprisoned in an empty treasure chest after he loses his grip while scaling a small cliff on the mysterious Island of Rare Animals (Gold Island in the 4Kids dub) trying to find some treasure with his pirate crew. The crew leaves Gaimon stranded on the island. The treasure chest becomes his body and cannot be removed, however, he can still use his hands, head and feet. It takes 20 years for another person to find him.<br/><br/>After Gaimon shrinks when he gets stuck in the chest, he can no longer scale the cliff. He has to protect his treasures somehow, so he would use his gun and his spooky voice to drive away intruders. Monkey D. Luffy and the whole crew passes the trial and they begin to become friends. However, when Luffy finally gets to the top of the cliff, Gaimon realized that the treasure chests were empty too and he had been protecting a nonexistent \"treasure\" for 20 years. He was offered to join the crew of the Strawhats but he declined. Then, he considers the animals as his treasures, and vows to protect them.<br/><br/>Chibi Buggy eventually meets, and befriends, Gaimon in the \"Special Cover Miniseries\".",
        "image": {
          "original": "https://media.kitsu.io/characters/images/475/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/475/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/475/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/475/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/475/castings"
          }
        }
      }
    },
    {
      "id": "476",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/476"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.458Z",
        "updatedAt": "2017-01-22T11:59:33.163Z",
        "slug": "zeff",
        "name": "Zeff",
        "malId": 10444,
        "description": "Former pirate captain, now the owner of the sea restaurant Baratie. He is the person who raised Sanji and taught him how to fight and to cook.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/476/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/476/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/476/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/476/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/476/castings"
          }
        }
      }
    },
    {
      "id": "477",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/477"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.490Z",
        "updatedAt": "2017-01-22T09:57:50.953Z",
        "slug": "conis",
        "name": "Conis",
        "malId": 10668,
        "description": "Conis is the first person to greet the Straw Hats Pirate Crew once they've reached Skypiea. She becomes an important character in the Skypiea arc because of her interaction with the Straw Hat pirates. Once it is discovered that the crew has not paid Skypiea's exorbitant toll, however, she regretfully follows the mandatory commands from their \"god\" Enel, which has been placed upon all her people under pain of death. They were not fulfilled and obeyed, and she reports them as trespassers. After this while leading Luffy, Sanji, and Ussop to Upper Yard, Conis under the burden of her betrayal breaks down and tells them the truth. This disloyalty to the god Enel is met with a wave of lightning from the heavens directed toward Conis. Luffy tries to save her but is caught in the middle of it too. Both barely escape with help from Gan Fall â€˜knight of the sky. Conis later makes up for her actions, by guiding the Merry Go through Upper Yard, warning her people of Enel's attack, and helping the Straw Hats back down to earth after they had defeated Enel.<br/><br/>Conis is head strong, hopeful, and cares deeply for the well being of others. When first introduced she seems happy, friendly, and acts innocent. After meeting the Straw Hat Pirates she keeps all those things. As she becomes more and more courageous, she speaks her mind and is not being afraid of her people's \"God\" Enel as they struggle to fight him. She is very good at playing the harp as well as being able to use a Waver. Though she never fought, she carried a Burn Bazooka and knew how to use an array of dials. Because of her musical abilities, it was speculated by fans to be the crew's new musician. However, Conis decided to remain in Skypiea.",
        "image": {
          "original": "https://media.kitsu.io/characters/images/477/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/477/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/477/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/477/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/477/castings"
          }
        }
      }
    },
    {
      "id": "478",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/478"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.504Z",
        "updatedAt": "2017-01-22T11:45:46.625Z",
        "slug": "pagaya",
        "name": "Pagaya",
        "malId": 10804,
        "description": "Conis's father and a brilliant inventor from Skypiea who fixes the waver Nami rides. He has a habit of apologizing for everything; even things that he isn't even responsible for, or things that warrant no apology whatsoever (introducing himself, accepting a drink, etc.).<br/><br/><span class=\"spoiler\">Pagaya was thought dead as Enel attacked him while he was helping an injured member of the Royal Guard, who had just revealed Enel's plans to destroy Skypeia. But he resurfaces later, alive and well. He helps the Straw Hat Pirates despite the fact that they were labeled as criminals for not paying their toll fee.</span><br/><br/>(Source: Wikipedia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/478/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/478/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/478/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/478/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/478/castings"
          }
        }
      }
    },
    {
      "id": "479",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/479"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.521Z",
        "updatedAt": "2017-01-22T10:47:56.243Z",
        "slug": "purinpurin",
        "name": "Purinpurin",
        "malId": 10830,
        "description": "Commodore Pudding Pudding is a Marine Commander in the 77th Branch of the Marines, who is dispatched to Arlong Park to evacuate the survivors of Arlong's tyrannical reign. He never arrives. When Pudding Pudding sees the Fishman's base, hubris gets the better of the Commander , and he orders an attack. This provokes Arlong's ire, and the Fishman crew makes quick work of Pudding Pudding and his ship, sending it to the bottom of the sea in an artificial maelstrom.<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/479/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/479/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/479/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/479/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/479/castings"
          }
        }
      }
    },
    {
      "id": "480",
      "type": "characters",
      "links": {
        "self": "https://kitsu.io/api/edge/characters/480"
      },
      "attributes": {
        "createdAt": "2013-02-20T18:49:34.537Z",
        "updatedAt": "2017-01-22T11:59:34.945Z",
        "slug": "porche",
        "name": "Porche",
        "malId": 10910,
        "description": "Porche is a member of the Foxy Pirates, and is considered an idol by the crew and is loved by all of the men.<br/><br/>She participates in the Donut Race. Her personality is like that of a very arrogant girl who lacks intelligence. She is very loyal to Foxy, but also has a huge obsession with Chopper since he's so cute. She refers to him as \"Choppy\", prefers for him to stay in his Brain Point form (When he turns into his Jumping Point form she yelled \"What happened to Choppy?! That's not cute at all!).\"<br/><br/>Her weapon is a baton-like weapon that shoots shurikens covered with flowers and, in the anime only, shoots out a purple gas (presumably some kind of knockout gas) that causes those hit by it to \"blank out\", leaving them helpless and can also hypnotize.<br/><br/>(Source: One Piece Wikia)",
        "image": {
          "original": "https://media.kitsu.io/characters/images/480/original.jpg?1483096805"
        }
      },
      "relationships": {
        "primaryMedia": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/480/relationships/primary-media",
            "related": "https://kitsu.io/api/edge/characters/480/primary-media"
          }
        },
        "castings": {
          "links": {
            "self": "https://kitsu.io/api/edge/characters/480/relationships/castings",
            "related": "https://kitsu.io/api/edge/characters/480/castings"
          }
        }
      }
    },
    {
      "id":"481",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/481"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.554Z",
        "updatedAt":"2017-01-22T10:30:54.974Z",
        "slug":"blueno",
        "name":"Blueno",
        "malId":11394,
        "description":"Blueno started his own bar about five years ago in the backstreets of Water Seven, calling it simply \"Blueno's Bar.\" It was in a seedy side of town, where vagrants and ne'erdowells coalesced, but he at least acted happy. In truth, alas, it wasn't so: Blueno was a covert agent of the government's sent to steal the plans to an Ancient Weapon.<br/><br/>It was in this fashion that Blueno met the supposed hidden king of Water Seven, Franky, and the two struck up a friendship of sorts. Again, it wasn't really so, but that friendship had some repercussions later on.<br/><br/>Blueno ate the Doa Doa no Mi (Door Door Fruit) which allows him to create doors on any surface. He has even created \"air doors\", doors in the air itself, which lead to what seems to be another dimension. Blueno is also able to create doors on people, and did so to Luffy's face, causing it to spin like a revolving door.<br/><br/>Blueno's tekkai seems to be the one of the more powerful ones of the group, and he was the first to reveal any variations of the move.<br/><br/>Source: <a href=\"http://arlongpark.net/\" rel=\"nofollow\" target=\"_blank\">http://arlongpark.net/</a>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/481/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/481/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/481/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/481/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/481/castings"
          }
        }
      }
    },
    {
      "id":"482",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/482"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.563Z",
        "updatedAt":"2017-01-22T11:14:32.791Z",
        "slug":"fukurou-39eaed31-4595-4cb0-a75a-f4b5a8f2d665",
        "name":"Fukurou",
        "malId":11396,
        "description":"Fukuro is a member of the three-man squad who took over the duties of CP9 during the absence of Lucci's cell. He's a real blabbermouth, always yakking about top-secret plans and things best left unsaid, to which Jabura reacts with anger while Kumadori reacts by trying to commit Seppuku (belly slitting, but he uses Tekkai at the last minute)!<br/><br/>Like the rest of CP9 Fukuro has access to the full extent of Rokushiki, and he shows himself as a superhuman by possessing tremendous skill at the \"super cartwheel\" Tekkai-dama, as well as his own special killer punch based off Shigan, Jugong. It's been speculated that his Tekkai is particularly good, as well, since he took the attacks of the rest of CP9 with relative ease, but this has yet to be explained (if it ever will be).<br/><br/>Fukurou claims he is a master of the soru technique, and is the first CP9 member to have used any variations of the move. With his soru he can move so fast that he is unable to be seen. He says that in this way he is like an owl, unseen and unheard by its prey until it is too late.<br/><br/>Source: <a href=\"http://arlongpark.net/\" rel=\"nofollow\" target=\"_blank\">http://arlongpark.net/</a>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/482/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/482/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/482/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/482/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/482/castings"
          }
        }
      }
    },
    {
      "id":"483",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/483"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.577Z",
        "updatedAt":"2017-01-22T11:51:32.767Z",
        "slug":"nero-456c4c47-b7ed-4cc2-af18-eaea418f2dc4",
        "name":"Nero",
        "malId":11398,
        "description":"Known as the Nero the Sea Weasel, Nero was considered the newest member of CP9. He was first introduced on the Puffing Tom, where he was helping to escort Nico Robin to Enies Lobby. However, as Nero is still a new recruit, he is only a yonshiki-tsukai (Ã¥â€ºâ€ºÃ¥Â¼ï¿½Ã¤Â½Â¿Ã£ï¿½â€ž, four-power user), instead of a rokushiki-tsukai (Ã¥â€¦Â­Ã¥Â¼ï¿½Ã¤Â½Â¿Ã£ï¿½â€ž, six-power user). The rokushiki that Nero has mastered are soru, geppou, kami-e, and rankyaku. He is still unable to use tekkai and shigan. However, he compensates for his lack of shigan by carrying guns with him, and compensates for his lack of tekkai by being very careful to avoid taking blows.<br/><br/>Nero attempted to stop Franky from rescuing Robin but was punched through the roof of Puffing Tom, into the room where the rest of CP9 was. Nero then continued to try to fight Franky and stated he would kill him, but Lucci wouldn't allow this, as they were simply supposed to be capturing him. Lucci then gave Nero three seconds to escape, at which point Lucci quickly took him out with five shigan attacks. Lucci then personally disbanded him from CP9. It is unknown whether or not Nero is dead or alive, as Lucci is a very skilled, shoot-to-kill sort of person, and Nero's limp body was thrown into the ocean during Aqua Laguna, one of the biggest storms in the world.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/483/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/483/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/483/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/483/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/483/castings"
          }
        }
      }
    },
    {
      "id":"484",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/484"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.586Z",
        "updatedAt":"2017-01-22T11:55:00.860Z",
        "slug":"jyabura",
        "name":"Jyabura",
        "malId":11400,
        "description":"Jyabura is the leader of team made by himself, Fukurou and Kumadori. He ate the Devil Fruit Inu Inu no Mi Model: Wolf (Dog Dog Fruit, Model: Wolf), which gives him the power to change into a full wolf and a human-wolf hybrid that resembles a werewolf.<br/><br/>He believes he has a strong rivalry with Rob Lucci, who seems mostly disinterested in any such notion. Jyabura is extremely competitive, and gets outraged when someone surpasses him (for instance, he didn't like when learned that Kaku became stronger than him). He is also very superstitious, believing that if someone who has eaten a Devil Fruit gets too close to another Devil Fruit, their body will explode as the two devils confront each other, though Blueno explains that this is not the case. While fighting, he tends to deceive his opponents to get them off guard.<br/><br/>Initially Jyabura chooses to fight with Sogeking, but after Sogeking showed to have no match, Sanji abruptly appears and saves his friend from being killed by Jyabura. It then starts a fight between Sanji and Jyabura, where Jyabura is defeated by Sanji's Diable Jambe, which breaks through Jyabura'sTekkai. Jyabura is the only one of his unit to master Tekkai Kempo, a technique that allows him to use martial arts while using Tekkai.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/484/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/484/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/484/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/484/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/484/castings"
          }
        }
      }
    },
    {
      "id":"485",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/485"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.595Z",
        "updatedAt":"2017-01-22T11:30:44.303Z",
        "slug":"rockstar",
        "name":"Rockstar",
        "malId":12232,
        "description":"Rockstar is a confident member of Shanks' crew who seems to have a lot of pride. When he was insulted by Whitebeard's men, he wanted to fight them because they had damaged his honor. He also tried to used the strength of his captain to back up the importance of a letter he delivered to Whitebeard. Shanks sent him to deliver a message to Whitebeard, which the pirate captain promptly ripped up, going along with Shanks' prediction anyway. Even so, Rockstar wanted to fight Whitebeard to reclaim his honor, but Shanks told him it was no big deal and to pull back.<br/><br/>Source: <a href=\"http://onepiece.wikia.com/\" rel=\"nofollow\" target=\"_blank\">One Piece Wikia</a>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/485/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/485/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/485/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/485/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/485/castings"
          }
        }
      }
    },
    {
      "id":"486",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/486"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.617Z",
        "updatedAt":"2017-01-22T09:34:13.340Z",
        "slug":"coby",
        "name":"Coby",
        "malId":12361,
        "description":"When he first appeared Coby was a small, timid, bespectacled boy with pink hair. He was slightly chubby and somewhat shorter than Luffy. After training with Garp, Coby became somewhat thinner and taller. He now stands nearly as tall as Luffy. He also gained a scar across his forehead above his right eye. He now wears a jacket with the standard Marine colors. <br/><br/>Personality<br/><br/>Coby is first introduced as a cowardly Chore Boy on board Alvida's ship. Through fear of being smashed by her Iron Mace, whenever she asked him who was the loveliest on the sea, he would reply, 'You are, Miss Alvida'. Eventually with the help of Luffy he found the courage to pursue his dream of leaving her and becoming a Marine.<br/><br/>The first time he appears to have changed is when he and Luffy arrive at the base Captain Morgan is at. Helmeppo holds a gun to his head, but he pulls together his courage and tells Luffy not to worry about him. After their mini-arc series, Helmeppo and he become good friends.<br/><br/>Coby values his friendship with Luffy a lot, as shown when even after their brief fight, he asks if they're still friends.<br/><br/>Abilities and Powers<br/><br/>In his first appearance he lacked any fighting skills. According to Alvida, the only reason why she kept him on was because he happened to be good at Navigation. He is seen during his mini-arc training alongside Helemeppo and Vice-Admiral Monkey D. Garp. He has since become strong enough to use Rokushiki, or at the very least, Soru. He also has some knowledge of swordsmanship, as he was seen practicing with Helmepppo, as well as Garp's attendant. <br/><br/><span class=\"spoiler\"> Current Events<br/><br/>He appears to be at Water 7 alongside Helmeppo after Garp pays Luffy a visit. He tells both Luffy and Zoro about \"The New World\", and also tells them that the next time they met, it will be in the New World, and the he will be an Admiral and he will have to fight and capture Luffy. Luffy just says he'll look forward to their fight.<br/><br/>Coby sees Luffy one more time as he leaves Water 7, when Garp attacks. <br/><br/>Coby makes another appearance later on, in the Marineford Arc, participating in the war alongside the marines. After shouting a plea to end the war, he is attacked by Admiral Akainu, only to faint before being saved by Shanks.<br/><br/>His whereabouts post timeskip are unknown. </span>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/486/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/486/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/486/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/486/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/486/castings"
          }
        }
      }
    },
    {
      "id":"487",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/487"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.657Z",
        "updatedAt":"2017-01-22T10:15:52.986Z",
        "slug":"helmeppo",
        "name":"Helmeppo",
        "malId":12362,
        "description":"The idiot son of Captain Morgan of the Marines. After Luffy defeats his father, he joins the Marines with Coby. He is seen in ep 314 along with Coby and is part of Luffy's Grandpa's marine crew and is much stronger from training with Luffy's Grandpa, Vice Admiral Garp.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/487/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/487/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/487/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/487/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/487/castings"
          }
        }
      }
    },
    {
      "id":"488",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/488"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.703Z",
        "updatedAt":"2017-01-22T09:35:09.701Z",
        "slug":"sengoku",
        "name":"Sengoku",
        "malId":13018,
        "description":"Devil Fruit: Hito Hito no Mi, Model: Daibutsu (Human-Human Fruit, Model: Golden Buddha)<br/><br/>The supreme commander of all Naval forces in the One Piece world, his status apparent by the life-size seagull attached to his hat. He oversees the workings of the Navy from his base in the Sanctuary of Marie Joie, and is subordinate only to the leaders of the World Government, the GorÃ…ï¿½sei. He also has a pet goat. \"Sengoku\" can be written in kanji mean \"warring states,\" which is a period of Japanese history. He was the one who, twenty years ago as an admiral, entrusted the Golden Den Den Mushi to Spandine, allowing him to order the Buster Call on Ohara. He also seems to dislike the Shichibukai like Vice Admiral Smoker. Sengoku is considered by Whitebeard as one of the few people that know the seas from the time of Gold Roger.<br/><br/><span class=\"spoiler\">He resigned from his position after the war with Whitebeard.</span>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/488/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/488/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/488/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/488/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/488/castings"
          }
        }
      }
    },
    {
      "id":"489",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/489"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.723Z",
        "updatedAt":"2017-01-22T12:01:24.137Z",
        "slug":"mr-4",
        "name":"Mr. 4",
        "malId":13109,
        "description":"Mr. 4 has a four on his bat and shirt. He's a large, and inhumanly strong batter. He wields a four ton bat. Being very dimwitted, he only listens to his partner's, Miss Merry Christmas, orders and rarely speaks. He has a dog named Lasso, who was once a gun who \"ate\" the Inu Inu no Mi (Mutt Mutt Fruit, in the English dubs), who now shoots explosive baseballs for Mr. 4 to hit at his opponents.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/489/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/489/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/489/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/489/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/489/castings"
          }
        }
      }
    },
    {
      "id":"490",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/490"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.733Z",
        "updatedAt":"2017-01-22T09:56:30.028Z",
        "slug":"calgara",
        "name":"Calgara",
        "malId":17190,
        "description":"Calgara was a hero of the Shandians who lived while Upper Yard was still a part of Jaya (some 400 years ago), and who befriended the explorer Montblanc Norland (the ancestor of Montblanc Cricket). A statue of him was erected after his death as an eternal reminder to the Shandians of his strength and courage. He had a daughter named Musse. Wiper is a direct descendant of his.<br/><br/>Calgara was quick to react and a strong believer in traditions of his people. He was hugely mistrusting of strangers. Calgara's personality changed after he met Norland with many of his outtakes of the world changing alongside it. One particular note was that after seeing his God for what it truly was (a giant snake), he dismisses all Gods including the Skypieans \"God\".",
        "image":{
          "original":"https://media.kitsu.io/characters/images/490/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/490/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/490/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/490/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/490/castings"
          }
        }
      }
    },
    {
      "id":"491",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/491"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.748Z",
        "updatedAt":"2017-01-22T10:09:15.078Z",
        "slug":"bepo",
        "name":"Bepo",
        "malId":17492,
        "description":"Bepo is a prominent member of the Heart Pirates under captain Trafalgar Law. He is a talking bear, a fact which he is apparently sensitive about. He is notable both for not being affected by the Haki power of Silvers Rayleigh as well as a kicking fighting style similar to that of Sanji.<br/><br/>He is also the one in charge of all new Heart Pirate members, possibly being the first mate.<br/>Birthday November 20 (Fur Day)<br/>Affiliations: Heart Pirates",
        "image":{
          "original":"https://media.kitsu.io/characters/images/491/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/491/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/491/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/491/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/491/castings"
          }
        }
      }
    },
    {
      "id":"492",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/492"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.759Z",
        "updatedAt":"2017-01-22T11:40:23.530Z",
        "slug":"gedatsu",
        "name":"Gedatsu",
        "malId":17561,
        "description":"One of Enel's priests.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/492/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/492/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/492/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/492/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/492/castings"
          }
        }
      }
    },
    {
      "id":"493",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/493"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.778Z",
        "updatedAt":"2017-01-22T10:13:30.445Z",
        "slug":"yorki",
        "name":"Yorki",
        "malId":17763,
        "description":"Appearance<br/>Yorki is a yellow haired pirate who typically wears a cowboy hat. He also has two tattoos on his face. One under his right eye and one under his lower lip. The tattoos resemble that Japanese Kanji (Ã£Æ’Â¨). He also wears a green captain's coat.<br/>In the anime, prior to his full appearance, he was depicted as a young brown haired tattoo less pirate that wore a tricone instead of the cowboy hat. His coat was also colored red instead of green. This was later changed in accordance to the manga's depiction.<br/><br/>History<br/>Fifty years ago before the current timeline, as Yorki and his crew were sailing the West Blue, they came across a baby whale that was lost. Seeing that the whale was crying, Brook, one of Yorki's crew, suggested that they cheer the whale up with some music. Having cheered the thing up, the whale, Laboon, began following Yorki and the rest of the Rumbar Pirates through their adventures. As Yorki and crew drew nearer to the Grand Line however, Yorki and some of the other Rumbar Pirates asked Brook to convince Laboon to stay in the West Blue since he was the closest to the whale. This was because Yorki and the rest feared that Laboon was too young to face the dangers of the Grand Line. When Brook's attempt to convince Laboon failed, Yorki ordered his crew to ignore Laboon and not play any music in hopes that Laboon would stop following them.<br/><br/>Grand Line<br/>Seemingly having convinced Laboon to stop following, Yorki and his crew sailed into the Grand Line through the Reverse Mountain. Upon arriving at the Grand Line, Yorki and his crew met up with Crocus and asked if they could stay to repair their ship. To their surprise then, they found out that Laboon had followed them into the Grand Line. For the next three months, Yorki and crew stayed to fix their ship whilst singing with Laboon all the while. Seeing that the Grand Line was just too dangerous for a young whale, Yorki asked Crocus to take care of Laboon while they ventured into the Grand Line. As Yorki and crew left Laboon in Crocus's care, they promised to return someday in two to three years and take Laboon back with them.<br/>While in the Grand Line, Yorki and his crew experienced all the hardships that the sea had to offer. Along the way, Yorki and his crew fought against a Marine base. For this attack, Yorki's bounty went up. Despite the challenges they encountered, Yorki and his crew sailed onwards. <br/><br/>Disease<br/>However, after disembarking at a forest, Yorki and some of the other Rumbar Pirates contracted an incurable disease. In order to save the rest of the crew, Yorki decided to take himself and the other infected, and escape the Grand Line through the Calm Belt. With much regret, Yorki told the crew that were still well to give his regards to Laboon. As he lay dying, he asked Brook to play his favorite song to send him off. Yorki's attempt to escape was then written in a report. However the report misinterpreted Yorki's escape as an act of cowardice rather than show his actual reason.<br/><br/>Anime and Manga Differences<br/>In the anime, prior to Yorki being properly shown in the manga, he was depicted as a typical tattoo less pirate wearing a typical tricone. This depiction of him was due to the unclear image of him during Crocus' flashback then in the manga. The image depicted Yorki shaking hands with Crocus however the captain's appearance was obscured along with the rest of the crew, with no indications at the time of the character Brook (who was noted as being thought up at the time of Laboon but not introduced until over three-hundred chapters later). The anime however changed this after he was fully revealed.<br/><br/>Trivia<br/>Yorki's nickname resembles that of the real life pirate, Calico Jack.<br/><br/>(source: <a href=\"http://onepiece.wikia.com/wiki/Yorki\" target=\"_blank\">http://onepiece.wikia.com/wiki/Yorki</a> )",
        "image":{
          "original":"https://media.kitsu.io/characters/images/493/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/493/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/493/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/493/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/493/castings"
          }
        }
      }
    },
    {
      "id":"494",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/494"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.803Z",
        "updatedAt":"2017-01-22T10:08:23.074Z",
        "slug":"spandine",
        "name":"Spandine",
        "malId":18437,
        "description":"Spandine is the father of Spandam and was CP9's chief 22 years ago. He led the \"investigation\" in Ohara and was responsible for summoning the Buster Call.<br/><br/>First Appearance: Chapter 392; Episode 275<br/><br/>(source: onepiece.wikia.com)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/494/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/494/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/494/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/494/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/494/castings"
          }
        }
      }
    },
    {
      "id":"495",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/495"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.815Z",
        "updatedAt":"2017-01-22T12:21:27.357Z",
        "slug":"mohmoo",
        "name":"Mohmoo",
        "malId":18783,
        "description":"Mohmoo is a giant \"sea cow\" (literally) that was brought from the Grand Line by Arlong's crew. It was he that destroyed Gosa Village. However when he encounters Luffy, Sanji and Yosaku's boat, he is promptly beaten, and used to tow their boat to the island. Later, during the battle at Arlong Park, he called upon by Hatchan (his caregiver) to the fight the Straw Hats. Despite memories of his first defeat, he does as told, only to be used in the Gomu Gomu no Kazaguruma, an attack by Luffy that takes out most of Arlong's forces, and then was thrown out of Arlong Park in the process, never to be seen again. Momoo is possibly an ophitauros.<br/>It can make a \"mooo\"ing sound like any cow. Apparently it got no problem staying on land since Arlongs crew pulled it right through the Gosa Village without it getting any known damages.<br/><br/>First Appearance: Chapter 73; Episode 31",
        "image":{
          "original":"https://media.kitsu.io/characters/images/495/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/495/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/495/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/495/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/495/castings"
          }
        }
      }
    },
    {
      "id":"496",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/496"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.830Z",
        "updatedAt":"2017-01-22T10:27:03.733Z",
        "slug":"kung-fu-dugong",
        "name":"Kung Fu Dugong",
        "malId":18784,
        "description":"First Appearance: Chapter 161; Episode 96 <br/><br/>The Kung-Fu Dugongs are a type of Dugong living in Arabasta that is famous for their martial arts skills and strength. Their code of honor states that once they are defeated, a Dugong must become the follower of the one who defeated them. Their code extends to any 'disciples' their master may have with him as well. Currently, their master is Luffy as he unwittingly defeated them all. They live in the Sandora River.<br/><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/496/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/496/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/496/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/496/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/496/castings"
          }
        }
      }
    },
    {
      "id":"497",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/497"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.841Z",
        "updatedAt":"2017-01-22T12:09:01.810Z",
        "slug":"killer",
        "name":"Killer",
        "malId":18827,
        "description":"Killer is a fighting crewman serving under <a href=\"http://myanimelist.net/character/14989/Eustass_Kid\" rel=\"nofollow\">Eustass Kid</a> as one of the Kid Pirates.<br/><br/>A native of South Blue, with his bounty of 162,000,000 Beli he is one of the Eleven Supernovas appearing on the Shabaody Archipelago and one of the only two that aren't captains, also the second appearing Supernova who does not seem to be in the possesion of Devil Fruit powers.<br/><br/>Killer is seen using a pair of scythe-bladed weapons that are capable of spinning around or being used as hand scythes these are used in combination with his kicks and high agility to make him into a truly formidable foe.<br/>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/497/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/497/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/497/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/497/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/497/castings"
          }
        }
      }
    },
    {
      "id":"498",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/498"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.854Z",
        "updatedAt":"2017-01-22T08:18:03.959Z",
        "slug":"jinbei",
        "name":"Jinbei",
        "malId":18938,
        "description":"Jinbe is a whale shark fishman who was the second captain of the Sunny Pirates after Fisher Tiger, and who became a Shichibukai eight years ago. Jinbe's name comes from jinbei-zame (Ã§â€Å¡Ã¥Â¹Â³Ã©Â®Â«), which means \"whale shark\" in Japanese. His epithet, Kaikyou would normally translate into \"Strait\" or \"Channel\". However since the kanji for it is written as (Ã¦ÂµÂ·Ã¤Â¾ Ã£ï¿½Â®) and not (Ã¦ÂµÂ·Ã¥Â³Â¡Ã£ï¿½Â®), the kyou part (Ã¤Â¾ ) of it comes from (Ã¤Â»Â»Ã¤Â¾ ), a honorific used when addressing a high ranking yakuza member, thus making his epithet a Japanese pun.<br/><br/><span class=\"spoiler\">During the Impel Down arc Jinbei refused to go to war with Whitebeard, getting himself locked up in Impel Down in the same cell as Ace. He then teams up with Luffy and the others to rescue Ace, and decided to give up his position as a Shichibukai.</span><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/498/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/498/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/498/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/498/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/498/castings"
          }
        }
      }
    },
    {
      "id":"499",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/499"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.877Z",
        "updatedAt":"2017-01-22T08:51:38.458Z",
        "slug":"duval",
        "name":"Duval",
        "malId":19168,
        "description":"Duval is an enormous man who was originally introduced wearing a medieval looking mask. While standing he shows around two and a half times a normal person height. He has a muscular torso but has skinny arms and legs. Besides his head and shoulders which are covered in armor, he wears an open leather jacket, black pants, cowboy boots, and a long fur cape.<br/><br/>Underneath his iron mask, Duval surprisingly looks exactly like Sanji's badly drawn wanted poster. Except for his eyebrow which swirls downward instead of upward like Sanji's, he is an exact duplicate to the drawing. Because of this appearance, he had a lot of trouble with the marines and bounty hunters, and thus had to conceal his face in order to protect himself. While Duval received alot of injuries because of this, his most devastating one is a scar on his back which he states is very painful.<br/><br/>Upon confronting Sanji in order to get revenge, Duval got his entire facial structure rearranged by Sanji's kicks. The result of such a crude and violent operation was a complete successful makeover. Due to Sanji's kicks, Duval's entire face had been rearranged into a handsome one completely different from the one he originally had. He absolutely loves it for the benefits it gives. Though turned handsome, Duval however has a hard time winking and thus his eyes would often not wink in unison.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/499/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/499/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/499/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/499/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/499/castings"
          }
        }
      }
    },
    {
      "id":"500",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/500"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.896Z",
        "updatedAt":"2017-01-22T09:39:41.340Z",
        "slug":"pappag",
        "name":"Pappag",
        "malId":19311,
        "description":"Pappug is a starfish that is Camie's pet and master. He is the creator of the Criminal fashion line and is mentoring Camie to be a famous designer. Although he is a starfish, he can speak in human language quite well. This is due to the fact that when he was young, he thought he was human and by the time he realized he wasn't, he had already learned to speak like a human. It is also shown that Pappug can play a guitar and sing quite well.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/500/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/500/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/500/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/500/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/500/castings"
          }
        }
      }
    },
    {
      "id":"501",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/501"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.912Z",
        "updatedAt":"2017-01-22T10:27:55.331Z",
        "slug":"macro",
        "name":"Macro",
        "malId":19375,
        "description":"Macro is a Fishman pirate and the leader the Macro Fishman Pirates. He first appeared in Hatchan's Sea-Floor Stroll mini-series. Macro is a Fishman whose fish half is a fish called Macropharynx, a Japanese scientific name for Gulper Eels. His fish half is specifically the Gulper Eel classified as Pelican Eel.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/501/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/501/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/501/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/501/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/501/castings"
          }
        }
      }
    },
    {
      "id":"502",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/502"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.922Z",
        "updatedAt":"2017-01-22T09:35:07.363Z",
        "slug":"tansui",
        "name":"Tansui",
        "malId":19376,
        "description":"Tansui is a member of the Macro Fishman Pirates. He is an Arowana Fishman. He talks very open mindedly, to the ire of Macro, even to Duval himself. He is apparently skilled in Fishman Karate, much like Kuroobi and Kapoty; although his skills are never seen as he is beaten before he can use them.<br/><br/>First Appearance: Chapter 197",
        "image":{
          "original":"https://media.kitsu.io/characters/images/502/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/502/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/502/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/502/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/502/castings"
          }
        }
      }
    },
    {
      "id":"503",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/503"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.936Z",
        "updatedAt":"2017-01-22T10:09:22.802Z",
        "slug":"gyaro",
        "name":"Gyaro",
        "malId":19379,
        "description":"Gyaro is a member of the Macro Fishman Pirates. He is a pop eyed goldfish Fishman. He is a swordsman, reportedly using a style called \"goldfish fencing\". Like many characters in One Piece he has a distinct laugh: eheheh. [1]<br/><br/>He was taken out with one punch along with Macro and Tansui by the newly freed Hachi.<br/><br/>First Appearance: Chapter 197",
        "image":{
          "original":"https://media.kitsu.io/characters/images/503/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/503/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/503/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/503/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/503/castings"
          }
        }
      }
    },
    {
      "id":"504",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/504"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.950Z",
        "updatedAt":"2017-01-22T10:01:14.075Z",
        "slug":"toriko",
        "name":"Toriko",
        "malId":19939,
        "description":"Race: Human<br/>Gender: Male<br/>Birthday: May 25th, 475 GA<br/>Age: 25 (start of the series); 29 (Post-Timeskip)<br/>Status: Alive<br/>Height: 220 cm<br/>Weight: 230 Kg<br/>Blood Type: O<br/>Affiliation: Four Heavenly Kings<br/>Hors-D'oeuvre: BB Corn<br/>Soup: Century Soup<br/>Fish Dish: Ougai<br/>Meat Dish: Neo (yet to acquire)<br/>Main: GOD (Has yet to acquire it)<br/>Salad: Air<br/>Dessert: Fruit of Rainbow<br/>Drink: Billion Bird Egg<br/><br/>A Bishoku-ya with an abnormally large appetite (a food serving for 500 people could only get him 1/10 full). Toriko is 25 years old, the same age as Komatsu. He is known as one of the \"Four Heavenly Kings\", and his nickname is \"The Glutton\". Despite having a huge appetite and massive power, he doesn't indiscriminately kill and eat any animal; he only kills those animals he decides to eat. He has immunity to seventy different poisons, created by injecting himself with a near fatal dose of each poison and causing his body to create antibodies. He also has an animal-like sense of smell. He has adopted the Battle Wolf's new born pup and named it Terry Cloth. Like the other Kings, Toriko started of as a chain animal.<br/><br/>Hunting Method: Toriko relies on his sheer monster-like strength to capture his targets.<br/><br/>Full Course Menu: Currently, Toriko has yet to fill his menu in any slot but Hors-D'oeuvre, Soup and dessert. He decided that God will be his main dish.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/504/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/504/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/504/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/504/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/504/castings"
          }
        }
      }
    },
    {
      "id":"505",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/505"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.962Z",
        "updatedAt":"2017-01-22T08:19:02.204Z",
        "slug":"sunny",
        "name":"Sunny",
        "malId":19940,
        "description":"Race: Human<br/>Gender: Male<br/>Birthday: 7 September<br/>Age: 24 (start of the series); 28 (Post-Time Skip)<br/>Status: Alive<br/>Height: 187cm<br/>Weight: 200 kg<br/>Blood Type: AB<br/>Affiliation: Four Heavenly Kings; IGO<br/>Occupation: Gourmet Hunter<br/>Hors-D'oeuvre: Beautiful Skin Caviar<br/>Soup: Charis Lobster Soup<br/>Fish Dish: Skin Whitening Tuna<br/>Meat Dish: Perfect Beauty Cattle<br/>Main: Jewel Meat<br/>Salad: Mochi Skin Bean Sprouts<br/>Dessert: EARTH (yet to acquire)<br/>Drink: Charis Dragon Scale Sake<br/><br/>Sunny (Sani) is one of the \"Four Heavenly Kings\" (Ã¥â€ºâ€ºÃ¥Â¤Â©Ã§Å½â€¹, shitennou), he is first shown to have great strength, like Toriko, introduced carrying a Regal Mammoth with one arm, although this was merely a clever trick due to the fact that he was actually using his monstrously strong hair, each one of its strings being strong enough to lift nearly 50 pounds.<br/><br/>He is Rin's older brother and a calm, collected pretty boy who judges the \"beauty\" of people's actions. He speaks in an elegant and almost flirting manner. He has a way of \"knocking\" without even touching the target, mostly related to his \"sensor\" talent which allows him to know the physical state of those around him. His \"sensor\" is actually thousands upon thousands of super thin hairs that can reach a maximum of 25 feet (7.6 m) in length. Sunny's body has a very high body temperature and powerful sense of touch, being touched by his hair or any part of his body can only be described as Sunny tasting whatever he is touching.<br/><br/>He seeks \"harmony\" in his dishes which is the perfect use of ingredients, perfect handling of the food and most importantly producing a prefect taste. He seems to be slightly in love with Komatsu (or at least his skills since they seem to produce the \"harmony Sunny looks for in meals). When he saw Rin, his calm personality disappears and is replaced by that of an over-protective older brother that is shocked by how much her body changed (gained weight from too many sweets), this leads to a rather comical sibling spat between the two. Despite this, anyone who harms Rin runs the risk of provoking his ire, in which case there is a 999.999 percent chance of said person dying. He is also aware of his sisters infatuation with Toriko and approves of it. He shows this when saying \"If you wish to take him as a husband, as long as he keeps you safe, I will be okay with it. I will make no objections nor voice any complaints.\"<br/><br/>He, and the other Four Heavenly Kings, were trained by Ichiryuu, the President of the IGO.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/505/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/505/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/505/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/505/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/505/castings"
          }
        }
      }
    },
    {
      "id":"506",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/506"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.973Z",
        "updatedAt":"2017-01-22T11:04:36.683Z",
        "slug":"komatsu-04972b23-5392-45d1-8f91-3e9dd02dddbb",
        "name":"Komatsu",
        "malId":19942,
        "description":"Race: Human<br/>Gender: Male<br/>Birthday: March 31st, 475 GA<br/>Age: 25 (start of the series); 29 (Post-Timeskip)<br/>Status: Alive<br/>Height: 155 cm<br/>Weight: 51 Kg<br/>Blood Type: A<br/>Affiliation: Four Heavenly Kings, IGO, Four Heavenly Kings<br/>Occupation: Chef for Hotel Gourmet; Toriko's partner<br/>Partner: Toriko<br/><br/>A five-star chef who works for Hotel Gourmet, part of the prestigious IGO (International Gourmet Organization). Komatsu is 25 years old, the same age as Toriko.<br/><br/>He is timid but greatly interested by what he finds in his travels with Toriko. As a result, he tries to overcome his fear and does his best to help. It is shown that he is a highly skilled and competent chief capable on carrying out delicate procedures such as the removal of a puffer-whale's poison sack. He is also able to create delicious plates from any food giving to him and he has such a large knowledge of foods that he knows which foods would work well together. He is also very observant, being easily able to discover edible organisms in the area. His skills didn't go unnoticed since he has impressed all three of the \"Four Heavenly Kings\". <br/><br/>Toriko noted he has skills even higher than five-star class, Coco who was surprised since Komatsu's skill is most likely world class and Sani seems to be in love with the way Komatsu works as a chef since it produces the \"harmony\" in food that Sani holds in such high regard. Because he is otherwise normal, he'll write a will whenever he come along on Toriko's hunts. He is also currently the only chef to successfully recreated the Century Soup. He keeps a baby Wall Penguin as a pet that contains the key ingredient for the soup in it's saliva.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/506/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/506/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/506/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/506/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/506/castings"
          }
        }
      }
    },
    {
      "id":"507",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/507"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.983Z",
        "updatedAt":"2017-01-22T09:40:51.337Z",
        "slug":"terry-cloth",
        "name":"Terry Cloth",
        "malId":19943,
        "description":"A new born Battle Wolf pup that has been adopted by Toriko, it sees Toriko as a parental figure a big surprise since the Battle Wolf by no means become attached to humans. Terry got his name from how Toriko described his fur. Only few foods suits its taste like gourmet world's foods.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/507/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/507/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/507/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/507/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/507/castings"
          }
        }
      }
    },
    {
      "id":"508",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/508"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:34.989Z",
        "updatedAt":"2017-01-22T10:02:12.959Z",
        "slug":"hina",
        "name":"Hina",
        "malId":20091,
        "description":"Captain Hina (Ã£Æ’â€™Ã£Æ’Å Ã¥Â¤Â§Ã¤Â½ï¿½ Hina Taisa) is an officer in the Marines, and the object of both Jango's and Fullbody's affections. She has received the nickname \"Hina the Black Cage\" because of her Ori Ori no Mi ability, which allows her to form restraints on people by swiping her limbs through them. Hina has a tendency to speak in the third person, though this only seems to add to her attractiveness for her subordinates.<br/><br/>She is a long-time friend of Commodore Smoker, joining the Marines at the same time as him, and helping him get out of situations where Smoker could have been fired.<br/><br/><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/508/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/508/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/508/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/508/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/508/castings"
          }
        }
      }
    },
    {
      "id":"509",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/509"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.018Z",
        "updatedAt":"2017-01-22T11:40:07.054Z",
        "slug":"miss-father-s-day",
        "name":"Miss Father's Day",
        "malId":20093,
        "description":"Along with Mr. 7, Miss Fathers Day (Ã£Æ’Å¸Ã£â€šÂ¹Ã£Æ’Â»Ã£Æ’â€¢Ã£â€šÂ¡Ã£Æ’Â¼Ã£â€šÂ¶Ã£Æ’Â¼Ã£â€šÂºÃ£Æ’â€¡Ã£Æ’Â¼, Misu FÃ„ï¿½zÃ„ï¿½zu DÃ„â€œ) is part of the \"Sniping\" pair who apparently are deployed for jobs where sniping is necessary. Miss Fathers Day has a strange sense of fashion involving frogs, and her Gero Gun is shaped like a frog and its bullets are shaped like frogs. Miss Father's Day shows up in the main story briefly during the climax of the Arabasta Kingdom storyline manning the giant cannon that Baroque Works has placed in the Arabasta capitol of Alubarna. Princess Vivi figures out the location of this cannon and, during the final moments of the battle of Alubarna, she (with the Straw Hat Crew's help) attacks it. Miss Fathers day and Mr. 7 attempt to stop her, but Vivi skillfully evades their gunfire and defeats them using her peacock slashers. <br/><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/509/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/509/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/509/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/509/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/509/castings"
          }
        }
      }
    },
    {
      "id":"510",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/510"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.039Z",
        "updatedAt":"2017-01-22T12:02:10.985Z",
        "slug":"miss-merry-christmas",
        "name":"Miss Merry Christmas",
        "malId":20098,
        "description":"Miss Merry Christmas is a Baroque Works agent partnered with Mr. 4. She is a stout, middle-aged woman with red hair, and wears a necktie that resembles a Christmas tree, which goes with her codename. Other notable attire includes a large pair of purple-lensed sunglasses, a basket strapped to her back, and sandals. Unlike her partner, who is very slow, Miss Merry Christmas talks very fast, often only pronouncing the first syllable of the word in a high-pitched, child-like voice. Miss Merry Christmas has the power of the Mogu Mogu no Mi (Ã£Æ’Â¢Ã£â€šÂ°Ã£Æ’Â¢Ã£â€šÂ°Ã£ï¿½Â®Ã¥Â®Å¸, Mole Mole Fruit, called the \"Diggy Diggy Fruit\" in the English versions), a Zoan type fruit that gives her the ability to transform into a giant mole or a mole-human hybrid, Usopp thinks is a penguin. Because of this transformation, she can easily dig underground in the sands of Arabasta and sneak up on opponents, and attack with her sharp digging claws.<br/><br/>Source: One Piece Wikia",
        "image":{
          "original":"https://media.kitsu.io/characters/images/510/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/510/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/510/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/510/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/510/castings"
          }
        }
      }
    },
    {
      "id":"511",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/511"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.062Z",
        "updatedAt":"2017-01-22T11:32:18.729Z",
        "slug":"saint-roswald",
        "name":"Saint Roswald",
        "malId":20175,
        "description":"Saint Roswald (Rosward Sei) is one of the World Nobles, whom is allowed to reside in the Holy city of Mariejois.<br/><br/>Roswald is noted to be the most responsible of his family seen, as seen when he scolded his children for their behaviour.<br/><br/><span class=\"spoiler\">Though he scolds his children he cares for them, has \"never hit his son\", despite his behaviour and showed deep anger at Luffy for hitting him. Like his daughter Shalulia, he has deep pride for his ancestry. Of his family, he is the only seen who didn't abuse anyone citizen or slave, though he shoots at the Straw Hat Pirates and supported the treatment that his children gave others.</span> <br/>He is first seen with his daughter, Saint Shalulia, looking down on his runaway-blown up slave, Dias, who was the Captain of the Acumate Pirates. After his dog urinates on the man, his daughter shoots him with a gun, displaying no remorse afterwards. A demon-like creature is seen behind him. Later in the story, it is revealed that the demon-like creature is in fact, Pirate Captain Jean Bart.<br/><br/>He is then seen at the Human Auctioning House, with his son Saint Charloss and daughter Saint Shalulia. He becomes displeased with his son, Charloss for bidding on Camie.<br/><br/><span class=\"spoiler\">When his son was attacked by Luffy, he used his cane (which is a concealed rifle) and started shooting randomly around Luffy, then shouted out for someone to call for an Admiral. Sanji kicks the cane out of hand, followed by Usopp knocking him unconscious, after accidentally falling down from the rooftop and smashing his face into the floor\".</span><br/>He is noted for having a \"Pirate Captain collection\".<br/><br/><span class=\"spoiler\">According to his daughter, Shalulia, he has never beaten his own son Charloss, something that the Straw Hats did in their first day on the island. His wife(s) have yet to be seen.<br/><br/>When Hancock speaks of her past, she identifies a man who was \"the very vision of terror itself\". The man's silhouette shows a hair-style that matches Roswald's family, however the only person in his family that matches the silhouette exactly is Roswald himself.</span><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/511/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/511/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/511/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/511/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/511/castings"
          }
        }
      }
    },
    {
      "id":"512",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/512"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.075Z",
        "updatedAt":"2017-01-22T10:06:30.626Z",
        "slug":"saint-shalulia",
        "name":"Saint Shalulia",
        "malId":20176,
        "description":"Saint Shalulia (Shalulia Guu) is a female World Noble, the sister of Saint Charloss, and the daughter of Saint Roswald.<br/><br/>Like other World Nobles she dresses in a suit with supplies her with oxygen to save her sharing the same air as commoners. Her hair inside the bubble is styled upwards, forming a curl above her head. She wears a veil over the lower half of her mouth and light tinted shades over her eyes. She also wears heart-shaped earrings. <br/><br/>She first appears when her slave, Dias escapes in the Sabaody Archipelago, making her father comment on her carelessness in ruining his captain collection. After Dias' collar explodes, she then mocks his pitifulness and shoots him. When she is done she walks away commenting on how next time she wants a giant as a slave.<br/><br/>Later she turns up at the Human Auctioning House with her father, waiting for her brother, Saint Charloss. She attempts to kill Camie while the Straw Hats were busy holding off guards but is stopped by the timely intervention of Silvers Rayleigh who knocks her out with a burst of \"spirit energy\".<br/><br/>She is later seen outside of the auction house, beside her beaten and unconscious father and brother, angrily shouting insults at the Marines for not capturing the Straw Hats yet. In her anger she swore that upon their capture she would force the pirate crew to beg on the ground for forgiveness from her and then bring Hell to them.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/512/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/512/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/512/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/512/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/512/castings"
          }
        }
      }
    },
    {
      "id":"513",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/513"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.088Z",
        "updatedAt":"2017-01-22T09:47:53.909Z",
        "slug":"dias",
        "name":"Dias",
        "malId":20177,
        "description":"Devil Dias was a pirate, former captain of the Acumate Pirates, but was captured and sold as a slave to the family of World Noble, Saint Roswald. He has a bounty of 60,000,000. He has, according to his own words, a wife and child.<br/><br/>When on Sabaody Archipelago he runs off and tries to break his chains, setting the collar he has around his neck to explode. He is then urinated on by Roswald's family dog and is shot by Saint Shalulia and the Marines carried him off.<br/><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/513/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/513/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/513/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/513/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/513/castings"
          }
        }
      }
    },
    {
      "id":"514",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/514"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.097Z",
        "updatedAt":"2017-01-22T08:22:19.421Z",
        "slug":"shakuyaku",
        "name":"Shakuyaku",
        "malId":20178,
        "description":"Shakuyaku, also know by her nickname Shakky, is the Bartender of Shakky's Rip-off Bar on the Sabaody Archipelago. She is a former pirate alongside her companion Rayleigh and is also known for once being chased by notable marine Monkey D. Garp.<br/><br/>Shakky is very smart, and seems to constantly seek information - particularly on other pirates. She also reads the newspapers in what one could assume to be an obsessive manner, as she believes strongly that knowledge is power. She was the one who informed Luffy of all of the nine other pirates whose bounties exceed one hundred million beli.<br/><br/>She also seems intent on keeping her age a secret; Luffy asked her how old she was when he heard that she had quit being a pirate forty years ago, but she immediately changed the subject. After meeting Luffy for a short time, she is impressed by him, and states that she's rooting for him to become the Pirate King. <br/><br/>She gave up the life of a pirate forty years ago to open a bar. She is infamous for charging exuberant prices for her goods, however she makes an exception for Hatchan and the Strawhats.<br/><br/><span class=\"spoiler\">The Straw Hats return from the Human Auctioning House, where they found Rayleigh, and the tells the group about Roger's fate. Currently, she is taking care of the wounded Hatchan, as the Straw Hats depart. Unknown to her, Camie, Pappug and Hatchan, Bartholomew Kuma teleported the Straw Hats away from the Sabaody Archipelago to different locations. While it was getting late and the Straw Hats have not been heard of since they left, Camie began to worry about their safety. While Pappug and Hatchan were convinced they'll be fine, Shakuyaku on the contrary, pointed out that their chances of facing a Marine Admiral and escaping are slim, and noted that the current era is slowly changing, so the Straw Hats must catch and hold on to \"the waves\" that will inevitably wash it away to survive.</span><br/><br/>(source: <a href=\"http://onepiece.wikia.com/wiki/Shakky\" rel=\"nofollow\" target=\"_blank\">Shakky@onepiecewikia</a>)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/514/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/514/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/514/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/514/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/514/castings"
          }
        }
      }
    },
    {
      "id":"515",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/515"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.107Z",
        "updatedAt":"2017-01-22T08:53:16.114Z",
        "slug":"urouge",
        "name":"Urouge",
        "malId":20294,
        "description":"Urouge is a monk turned pirate who hails from a sky island like Skypiea. He is one of eleven pirates who have been referred to as \"The Eleven Supernovas\" on Sabaody Archipelago whose bounties are higher than 100,000,000 when the Straw Hats arrive in the place. He is the one with the lowest bounty of the said eleven. Urouge is from a Sky Island, judging by the style of the wings on his back this would indicate he is of Bilkan origins",
        "image":{
          "original":"https://media.kitsu.io/characters/images/515/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/515/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/515/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/515/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/515/castings"
          }
        }
      }
    },
    {
      "id":"516",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/516"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.117Z",
        "updatedAt":"2017-01-22T12:07:30.421Z",
        "slug":"peterman",
        "name":"Peterman",
        "malId":20307,
        "description":"Peterman (Ã£Æ’â€Ã£Æ’Â¼Ã£â€šÂ¿Ã£Æ’Â¼Ã£Æ’Å¾Ã£Æ’Â³, Piitaaman) is the head of a kidnapping gang called the Hound Pets, located at Shabondy Archipelago. He is informed by bounty hunters (as they were wounded they were most likely those that tried to attack the Strawhats for their bounties earlier) that Camie, a mermaid, is at Shabondy Park. He then arranges a deal of 10% of her final selling price to the bounty hunters and goes leaves to kidnap her.<br/><br/>He later takes her to the Human Auctioning House, to come back after she's sold for his share of the money. He never gets the chance however as the SH managed to rescue her then visit his hideout and give him a deserved beating for his actions. <br/><br/>(source: <a href=\"http://onepiece.wikia.com/wiki/Peterman\" rel=\"nofollow\" target=\"_blank\"></a><a href=\"http://onepiece.wikia.com/wiki/Peterman\" rel=\"nofollow\" target=\"_blank\"></a><a href=\"http://onepiece.wikia.com/wiki/Peterman\" rel=\"nofollow\" target=\"_blank\">http://onepiece.wikia.com/wiki/Peterman</a>",
        "image":{
          "original":"https://media.kitsu.io/characters/images/516/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/516/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/516/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/516/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/516/castings"
          }
        }
      }
    },
    {
      "id":"517",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/517"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.127Z",
        "updatedAt":"2017-01-22T10:54:17.945Z",
        "slug":"saint-charloss",
        "name":"Saint Charloss",
        "malId":20308,
        "description":"Saint Charloss (Charlosse Sei) is one of the World Nobles.<br/><br/>He is the son of Saint Roswald and the brother of Saint Shalulia. <br/>Like all the known World Nobles in the story, Saint Charloss is arrogant as well. <br/><br/>Mucus was constantly seen running down his nose and dripping.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/517/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/517/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/517/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/517/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/517/castings"
          }
        }
      }
    },
    {
      "id":"518",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/518"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.141Z",
        "updatedAt":"2017-01-22T11:45:36.532Z",
        "slug":"disco",
        "name":"Disco",
        "malId":20814,
        "description":"Disco is incharge of the Human Auctioning House at Grove 1. He is a brutal person, who went on to abuse and kicked Camie when brought to him, but before he could beat her up more he was forced to faint by Silvers Rayleigh, using a \"Burst of Spirit\".<br/><br/>After being shot by Shalulia, he was later seen calling the shop's owner, Shichibukai Donquixote Doflamingo for help - but after he told him he could have the shop, and that he wasn't interested in it anymore, he was told that the government were calling the 7 Shichibukai to battle against the Whitebeard Pirates.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/518/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/518/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/518/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/518/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/518/castings"
          }
        }
      }
    },
    {
      "id":"519",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/519"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.151Z",
        "updatedAt":"2017-01-22T12:04:07.926Z",
        "slug":"borsalino",
        "name":"Borsalino",
        "malId":21093,
        "description":"Admiral Kizaru is one of the three Admirals in the Marines. His name means \"Yellow Monkey\" in Japanese while his original name was Borsalino . He was first mentioned by Robin during the initial encounter with Aokiji.<br/><br/>Kizaru is a middle aged man with a moderate amount of wrinkles on his face. He has appeared in a yellow striped suit with the standard Marines' coat over it. He wears shades and a portable Den Den Mushi on his wrist. He is very tall, about the same height as Aokiji.<br/><br/>The way Kizaru's character design is drawn resembles the famous Japanese actor, Kunie Tanaka. <br/><br/>Kizaru's personality appears a combination of the more laid-back Aokiji and the more ruthless Akainu. <br/><br/>Like Aokiji, Kizaru seems to be very laid-back and easygoing, even in surprising and unexpected situations, but he's apparently never shocked. Even when a pirate fired a gunshot at him, he seemed to be focused only on calling his subordinate, and didn't even mind. He even asked the offenders where his subordinate was. After uprooting a mangrove tree, he laughed to himself that the force he used was a tad excessive. He's also very calm and cool-headed, even in tense situations, such as when Basil Hawkins appeared unharmed by his attack, or when Rayleigh appeared. Unfortunately, he can be quite absent-minded and irresponsible, judged by the fact he used a lot of power in a kick directed at escaping pirates, uprooted an entire mangrove tree, and tried to call Sentoumaru with a black Den Den Mushi, which is only for intercepting communications. He also seems to prefer his original name, Borsalino, rather than his alias, as shown when Sentoumaru called him and he said, \"This is Borsalino\". <br/><br/>However, more in line with Akainu, he is shown to have a ruthless side: he gives criminals, in particular pirates, very little mercy once he has targeted them. He even planned to capture Silvers Rayleigh, who had given up pirating over twenty years earlier, simply because he was the first mate of the Jolly Roger Pirates. Following the events of the Sabaody Archipelago, Kizaru has captured 500 pirates out of spite. Also like Smoker and Sengoku, he sees the Shichibukai as nothing more than just pirates, even if they are on the World Government's side.<br/><br/>As an Admiral, Kizaru commands vast numbers of Marine troops that are under his rank. Most of all, he has the ability to order a Buster Call attack on any island.<br/><br/>Kizaru possesses the power of the Pika Pika no Mi, meaning glimmer or light, a Logia-type Devil Fruit. As a Logia-user, he is able to let objects pass through him and reconstruct his body from energy particles. He's as fast as light. All of his attacks are based on the element of light, such as firing energy blasts from his finger tips or feet. His power is very destructive, causing huge explosions and easily destroying buildings.<br/><br/>Kizaru has shown considerable skill with a sword as he is able to duel Silvers Rayleigh to a draw despite his loss of intangibility.<br/><br/>(Source: One Piece Wikia)",
        "image":{
          "original":"https://media.kitsu.io/characters/images/519/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/519/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/519/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/519/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/519/castings"
          }
        }
      }
    },
    {
      "id":"520",
      "type":"characters",
      "links":{
        "self":"https://kitsu.io/api/edge/characters/520"
      },
      "attributes":{
        "createdAt":"2013-02-20T18:49:35.162Z",
        "updatedAt":"2017-01-22T11:05:52.003Z",
        "slug":"pascia",
        "name":"Pascia",
        "malId":21095,
        "description":"An anime-only character. He is a member of the Neo Marines, a former Commodore of the Marines and now a prisoner of Impel Down. He is the main antagonist of the Z's Ambition Arc.",
        "image":{
          "original":"https://media.kitsu.io/characters/images/520/original.jpg?1483096805"
        }
      },
      "relationships":{
        "primaryMedia":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/520/relationships/primary-media",
            "related":"https://kitsu.io/api/edge/characters/520/primary-media"
          }
        },
        "castings":{
          "links":{
            "self":"https://kitsu.io/api/edge/characters/520/relationships/castings",
            "related":"https://kitsu.io/api/edge/characters/520/castings"
          }
        }
      }
    }
  ]
}
